{
  "WCAG2.1": {
    "1.3.1": {
      "1": {
        "SUMMARY": "Is deze regel bedoeld als lijn of figuur?",
        "DESCRIPTION": "Deze regel bevat een heleboel herhaalde tekens. Bedenk dat een screenreader deze tekens één voor één opleest. Dat kan erg verwarrend en hinderlijk zijn voor mensen met een gezichtsbeperking. Probeerde je hiermee een figuur, lijn of formulier te maken? Voeg dan een lijn of afbeelding in. Gebruik hiervoor geen herhaalde underscores, streepjes of andere tekens."
      },
      "2": {
        "SUMMARY": "Vermijd herhaalde spaties",
        "DESCRIPTION": "Deze regel bevat herhaalde spaties. Gebruikte je deze om tekst op te lijnen? Dat kan je beter doen door in de alinea inspringen in te stellen. Of gebruik tabs. Als de spaties aan het einde van de regel staan, hebben ze waarschijnlijk geen functie en kan je ze beter weglaten."
      },
      "3": {
        "SUMMARY": "Vermijd onderstrepen",
        "DESCRIPTION": "Het is niet verboden om tekst te onderstrepen, maar veel mensen zien onderstreepte tekst aan voor een hyperlink. Je kan onderstreping daarom beter vermijden. Als je tekst nadruk wilt geven gebruik dan het beste vetgedrukt."
      },
      "4": {
        "SUMMARY": "Heeft deze tekst een bijzondere betekenis?",
        "DESCRIPTION": "Deze tekst ziet er anders uit dan de omringende tekst. Als je de tekst anders hebt opgemaakt omdat deze tekst een bijzondere betekenis heeft, dan moet je ervoor zorgen dat die betekenis ook gecodeerd is. Je doet dat bijvoorbeeld door voor deze opmaak een speciale stijl te maken."
      }
    },
    "1.3.4": {
      "1": {
        "SUMMARY": "Het document heeft pagina's in zowel staande als liggende opmaak",
        "DESCRIPTION": "Zorg dat alle pagina's een staande of liggende opmaak hebben. Gebruik pagina's met staande en liggende opmaak niet door elkaar tenzij dat essentiëel is voor de informatie die je wilt communiceren."
      }
    },
    "1.4.3": {
      "1": {
        "SUMMARY": "Onvoldoende contrast",
        "DESCRIPTION": "Tekst moet voldoende contrast met de achtergrond hebben, anders kunnen slechtzienden en kleurenblinden problemen hebben om deze te lezen. Zwarte tekst op een (bijna) witte achtergrond is meestal het veiligst. Gebruik je toch kleuren, zorg dan dat de tekst tenminste een contrast van 4,5 : 1 met de achtergrond heeft (voor heel grote tekst mag het 3 : 1 zijn)."
      }
    },
    "1.4.4": {
      "1": {
        "SUMMARY": "Dit lettertype is erg klein",
        "DESCRIPTION": "Dit lettertype is zo klein dat mensen met een gezichtsbeperking het waarschijnlijk moeilijk kunnen lezen. Probeer zoveel mogelijk lettertypen van 11 punten of meer te gebruiken."
      }
    },
    "1.4.8": {
      "1": {
        "SUMMARY": "Het document bevat lettertypen die moeilijk leesbaar zijn. Dit betreft lettertype(n): ",
        "DESCRIPTION": "In het document gebruik je fancy lettertypen die moeilijk te lezen zijn. Screenreaders kunnen deze tekst voorlezen, maar slechtzienden, mensen met ADHD of mensen in het autismespectrum kunnen moeite hebben om dit te lezen. Tenzij deze tekst echt als voorveeld van onleesbare tekst bedoeld was, kan je beter een standaard lettertype gebruiken zoals Arial, Verdana of Times Roman."
      }
    },
    "1.4.10": {
      "1": {
        "SUMMARY": "Deze afbeelding is niet volledig gecodeerd",
        "DESCRIPTION": "De code van deze afbeelding heeft geen kenmerkobject ('bounding box'). Daardoor kunnen PDF readers de pagina mogelijk niet goed herschikken ('reflow')."
      }
    },
    "2.4.9": {
      "1": {
        "SUMMARY": "Deze link heeft geen heldere beschrijving",
        "DESCRIPTION": "Deze link heeft geen alternatieve beschrijving. Bedenk dat screenreaders deze URL van voor tot achter voorlezen. Dat is erg onhandig voor een gebruiker met een gezichtsbeperking. Vermijd daarom het opnemen van lange URLs in je tekst. Zet links onder een beschrijvende tekst OF voorzie de link van een alternatieve beschrijving (net als afbeeldingen)."
      }
    },
    "4.1.1": {
      "1": {
        "SUMMARY": "Deze tabel bevat samengevoegde cellen",
        "DESCRIPTION": "Samengevoegde cellen maken het moelijker voor screenreaders om de tabel voor te lezen voor mensen met een gezichtsbeperking. Houd tabellen zo eenvoudig mogelijk en probeer het samenvoegen van cellen zoveel mogelijk te beperken."
      },
      "2": {
        "SUMMARY": "Deze tabelkop bevat samengevoegde cellen",
        "DESCRIPTION": "Samengevoegde cellen in de kop maken het moelijker voor screenreaders om de tabel voor te lezen voor mensen met een gezichtsbeperking. Houd tabellen en hun koppen zo eenvoudig mogelijk en probeer het samenvoegen van cellen zoveel mogelijk te beperken."
      },
      "3": {
        "SUMMARY": "Deze tabel lijkt samengevoegde cellen te hebben",
        "DESCRIPTION": "Samengevoegde cellen maken het moelijker voor screenreaders om de tabel voor te lezen voor mensen met een gezichtsbeperking. Houd tabellen zo eenvoudig mogelijk en probeer het samenvoegen van cellen zoveel mogelijk te beperken."
      }
    },
    "4.1.2": {
      "1": {
        "SUMMARY": "Moeten dit niet verschillende alineas zijn?",
        "DESCRIPTION": "Deze text is gelabeld als één alinea, maar het moeten het niet verschillende alineas zijn? Vermijd zo veel mogelijk het breken van regels met regeleinden (line breaks). Het is beter om alineas te gebruiken. Maak van regels met verschillende uitlijning of opmaak verschillende alineas."
      },
      "2": {
        "SUMMARY": "Hoort deze tekst wel bij elkaar?",
        "DESCRIPTION": "Deze tekst is gelabeld alsof deze bij elkaar hoort, maar is dat ook zo? Zorg dat tekst die semantisch of qua opmaak niet bij elkaar hoort ook als verschillende tekst wordt gelabeld, bijvoorbeeld door er verschillende alineas van te maken."
      },
      "3": {
        "SUMMARY": "Is dit echt een tabel?",
        "DESCRIPTION": "Deze tekst is als tabel gelabeld, maar het lijkt geen echte tabel. Gebruik tabellen nooit om tekst op te lijnen of te omkaderen. Maak deze tekst op als gewone alinea in plaats van een tabel. Gebruik daarbij tabs om op te lijnen en randen om tekst te omkaderen. Beter nog, gebruik stijlen om tekst door het document heen eenduidig op te lijnen en op te maken."
      },
      "4": {
        "SUMMARY": "Is dit wel een kop?",
        "DESCRIPTION": "Deze tekst is gelabeld als kop, maar lijkt net als kop bedoeld te zijn. Als dit geen kop is, zorg dat deze dan ook niet als zodanig gelabeld is. Bijvoorbeeld door er een alinea in een standaard tekst stijl van te maken."
      },
      "5": {
        "SUMMARY": "Is dit wel een kop?",
        "DESCRIPTION": "Deze tekst is gelabeld als kop, maar lijkt net als kop bedoeld te zijn. Als dit geen kop is, zorg dat deze dan ook niet als zodanig gelabeld is. Bijvoorbeeld door er een alinea in een standaard tekst stijl van te maken."
      },
      "6": {
        "SUMMARY": "Is dit een rij in een tabel?",
        "DESCRIPTION": "Deze tekst ziet eruit als een rij in een tabel maar is niet als zodanig gelabeld. Maak nooit tabellen met de hand op, want dat brengt screenreaders in de war. Maak altijd gebruik van het menu invoegen - tabel in je kantoorapplicatie. Zo zorg je dat tabellen ook als tabellen worden gelabeld en herkend."
      },
      "7": {
        "SUMMARY": "Is dit een kop van een tabel?",
        "DESCRIPTION": "Deze tekst ziet eruit als een tabelkop maar is niet als zodanig gelabeld. Maak nooit tabellen met de hand op, want dat brengt screenreaders in de war. Maak altijd gebruik van het menu invoegen - tabel in je kantoorapplicatie. Zo zorg je dat tabellen ook als tabellen worden gelabeld en herkend."
      },
      "8": {
        "SUMMARY": "Is dit een cel van een tabel?",
        "DESCRIPTION": "Deze tekst ziet eruit als een tabelcel maar is niet als zodanig gelabeld. Maak nooit tabellen met de hand op, want dat brengt screenreaders in de war. Maak altijd gebruik van het menu invoegen - tabel in je kantoorapplicatie. Zo zorg je dat tabellen ook als tabellen worden gelabeld en herkend."
      },
      "9": {
        "SUMMARY": "Is dit een tabel?",
        "DESCRIPTION": "Deze tekst ziet eruit als een tabel maar is niet als zodanig gelabeld. Maak nooit tabellen met de hand op, want dat brengt screenreaders in de war. Maak altijd gebruik van het menu invoegen - tabel in je kantoorapplicatie. Zo zorg je dat tabellen ook als tabellen worden gelabeld en herkend."
      },
      "10": {
        "SUMMARY": "Is dit een kop?",
        "DESCRIPTION": "Deze tekst lijkt bedoeld te zijn als kop, maar is niet als zodanig gelabeld. Zorg dat je koppen altijd in één van de standaard kopstijlen (Kop 1, Kop 2, Kop 3, enz) opmaakt. Dan weten screenreaders ook dat het echt koppen zijn, en dat helpt de gebruiker navigeren door het document. Als je de standaard kopstijlen niet mooi vindt kan je de opmaak ervan zelf aanpassen."
      },
      "11": {
        "SUMMARY": "Moet dit wel een aparte alinea zijn?",
        "DESCRIPTION": "Deze tekst lijkt niet als aparte alinea bedoeld te zijn. Vermijd nieuwe alineas als dat niet nodig is."
      },
      "12": {
        "SUMMARY": "Moet dit geen alinea zijn?",
        "DESCRIPTION": "Deze tekst lijkt als alinea bedoeld te zijn, maar is anders gelabeld. Zorg dat je tekst als alinea opmaakt, bijvoorbeeld met de Standaard stijl of een andere alineastijl."
      },
      "13": {
        "SUMMARY": "Is dit een kop?",
        "DESCRIPTION": "Deze tekst lijkt bedoeld te zijn als kop, maar is niet als zodanig gelabeld. Zorg dat je koppen altijd in één van de standaard kopstijlen (Kop 1, Kop 2, Kop 3, enz) opmaakt. Dan weten screenreaders ook dat het echt koppen zijn, en dat helpt de gebruiker navigeren door het document. Als je de standaard kopstijlen niet mooi vindt kan je de opmaak ervan zelf aanpassen."
      },
      "14": {
        "SUMMARY": "Is dit wel een kop?",
        "DESCRIPTION": "Deze tekst is gelabeld als kop, maar lijkt als gewone tekstalinea bedoeld te zijn. Als dit geen kop is, zorg dat deze dan ook niet als zodanig gelabeld is. Bijvoorbeeld door er een alinea in een standaard tekst stijl van te maken."
      },
      "15": {
        "SUMMARY": "Is dit wel een kop?",
        "DESCRIPTION": "Deze tekst is gelabeld als kop, maar lijkt als gewone tekstalinea bedoeld te zijn. Als dit geen kop is, zorg dat deze dan ook niet als zodanig gelabeld is. Bijvoorbeeld door er een alinea in een standaard tekst stijl van te maken."
      },
      "16": {
        "SUMMARY": "Lege alinea",
        "DESCRIPTION": "Er staan lege alinea's in je document. Vermijd alineas zonder tekst, dit brengt screenreaders in de war. Gebruik nooit lege alineas om witregels in te voegen. Witregels maak je door in het menu 'Alinea' naar de tab 'Inspringen en afstand' te gaan en daar de Afstand 'voor' of 'na' groter te maken."
      },
      "17": {
        "SUMMARY": "Leeg tekstelement",
        "DESCRIPTION": "Er staan lege tekstregels in je document. Vermijd regels zonder tekst, dit brengt screenreaders in de war. Gebruik nooit regels zonder tekst om witregels in te voegen. Witregels maak je door in het menu 'Alinea' naar de tab 'Inspringen en afstand' te gaan en daar de Afstand 'voor' of 'na' groter te maken."
      },
      "18": {
        "SUMMARY": "Lege kop",
        "DESCRIPTION": "Er staan lege koppen in je document. Vermijd koppen zonder tekst, dit brengt screenreaders in de war. Gebruik nooit lege koppen om witregels in te voegen. Witregels maak je door in het menu 'Alinea' naar de tab 'Inspringen en afstand' te gaan en daar de Afstand 'voor' of 'na' groter te maken."
      },
      "19": {
        "SUMMARY": "Lege kop",
        "DESCRIPTION": "Er staan lege koppen in je document. Vermijd koppen zonder tekst, dit brengt screenreaders in de war. Gebruik nooit lege koppen om witregels in te voegen. Witregels maak je door in het menu 'Alinea' naar de tab 'Inspringen en afstand' te gaan en daar de Afstand 'voor' of 'na' groter te maken."
      },
      "20": {
        "SUMMARY": "Is dit een bijschrift van de figuur of tabel?",
        "DESCRIPTION": "Deze tekst lijkt bedoeld te zijn als bijschrift van de figuur of tabel, maar is gecodeerd als gewone alinea. Voor digitale toegankelijkheid is het beter om een bijschrift ook als zodanig te coderen. Helaas kan dat niet met de huidige PDF export van Word."
      },
      "21": {
        "SUMMARY": "Is dit een opsomming of genummerde lijst?",
        "DESCRIPTION": "Deze tekst lijkt een opsomming of genummerde lijst te zijn maar is niet als zodanig opgemaakt. Maak opsommingen en genummerde lijsten niet handmatig op maar gebruik hiervoor altijd de functionaliteit van Word of LibreOffice."
      },
      "22": {
        "SUMMARY": "Is dit wel een lijst?",
        "DESCRIPTION": "Deze tekst is in de code gemarkeerd als lijst, maar het lijkt geen echte lijst te zijn. Als deze tekst niet als lijst bedoeld was, kan je hem beter opmaken als een gewone tekstalinea. Je kan deze waarschuwing ook krijgen als je een lijst onderbroken hebt met gewone tekst. Dat kan je beter vermijden omdat screenreaders er moeite mee hebben om dit op een begrijpelijke manier voor te lezen."
      },
      "23": {
        "SUMMARY": "Is dit wel een onderdeel van een lijst?",
        "DESCRIPTION": "Deze tekst ziet er niet uit als onderdeel van een lijst, maar is wel zo gecodeerd. Dit kan screenreaders in de war brengen. Als je lijsten maakt, onderbreek deze dan niet met regeleinden of alinea's."
      },
      "25": {
        "SUMMARY": "Is dit wel een lijst?",
        "DESCRIPTION": "Deze tekst ziet er niet uit een lijst, maar is wel als lijst gecodeerd. Dit kan screenreaders in de war brengen. Als je lijsten maakt, onderbreek deze dan niet met regeleinden of alinea's."
      },
      "26": {
        "SUMMARY": "Is dit als tabel bedoeld?",
        "DESCRIPTION": "Deze tekst ziet eruit als een tabel, maar is in de code gemarkeerd als lijst. Als dit als tabel bedoeld was, kan je het ook beter opmaken als tabel."
      },
      "27": {
        "SUMMARY": "Zijn dit verschillende alinea's?",
        "DESCRIPTION": "Deze tekst is gecodeerd als één enkele alinea, maar het lijken verschillende alinea's te zijn. Gebruik voor nieuwe alinea altijd een alineaeinde (<Enter>). Gebruik geen regeleinde (<Shift><Enter>) om een nieuwe alinea te beginnen. In Word kan je de alineaeinden zien door het Bestand - Opties - Weergave menu te openen en dan Alineamarkeringen aan te vinken."
      },
      "28": {
        "SUMMARY": "Is dit deel van de inhoudsopgave?",
        "DESCRIPTION": "Deze tekst lijkt onderdeel van de inhoudsopgave te zijn, maar is niet als zodanig gecodeerd. Genereer inhoudsopgaven altijd automatisch. Maak ze niet met de hand aan en bewerk ze niet."
      },
      "29": {
        "SUMMARY": "Lege titel in de inhoudsopgave",
        "DESCRIPTION": "Deze titel in de inhoudsopgave lijkt leeg te zijn. Genereer inhoudsopgaven altijd automatisch. Maak ze niet met de hand aan en bewerk ze niet."
      },
      "30": {
        "SUMMARY": "Deze titel in de inhoudsopgave verwijst nergens naar",
        "DESCRIPTION": "Deze titel in de inhoudsopgave heeft geen link naar een pagina. Genereer inhoudsopgaven altijd automatisch. Maak ze niet met de hand aan en bewerk ze niet."
      },
      "31": {
        "SUMMARY": "Deze titel verwijst naar de verkeerde pagina",
        "DESCRIPTION": "Het paginanummer bij deze titel komt niet overeen met de paginalink. Genereer inhoudsopgaven altijd automatisch. Maak ze niet met de hand aan en bewerk ze niet."
      },
      "32": {
        "SUMMARY": "Inhoudsopgave lijkt niet goed opgelijnd",
        "DESCRIPTION": "Het lijkt erop dat verschillende onderdelen van de inhoudsopgave niet goed zijn opgelijnd. Daardoor is de inhoudsopgave moeilijker leesbaar. Genereer inhoudsopgaven altijd automatisch. Maak ze niet met de hand aan en bewerk ze niet."
      },
      "33": {
        "SUMMARY": "Titel in de inhoudsopgave komt niet overeen met hoofdstuk op de pagina",
        "DESCRIPTION": "De titel die in de inhoudsopgave staat komt niet overeen met het hoofdstuk waar hij naar verwijst. Genereer inhoudsopgaven altijd automatisch. Maak ze niet met de hand aan en bewerk ze niet."
      },
      "34": {
        "SUMMARY": "Is dit een samenhangende lijst?",
        "DESCRIPTION": "Dit lijkt een samenhangende lijst te zijn maar is gecodeerd als een serie kortere lijsten of andere structuren. Als het een samenhangende lijst is, zorg dan ook dat deze als één lijst gecodeerd is. Maakt lijsten niet met de hand aan, maar met de lijstfunctionaliteit in je kantoorapplicatie."
      },
      "35": {
        "SUMMARY": "De inhoudsopgave is onhandig gecodeerd",
        "DESCRIPTION": "De inhoudsopgave is gecodeerd als een serie verschillende inhoudsopgaven. Dat maakt navigeren door het document lastig. Genereer inhoudsopgaven altijd automatisch. Maak ze niet met de hand aan en bewerk ze niet."
      },
      "36": {
        "SUMMARY": "Hoeveel rijen heeft deze tabel?",
        "DESCRIPTION": "Het werkelijke aantal rijen in de tabel lijkt niet overeen te komen met de codering. Een screenreader zal daardoor iets anders voorlezen dan wat er te zien is. Maak een tabel altijd aan met de tabelfunctie van je kantoorapplicatie. Vermijd het samenvoegen en splitsen van elementen en ga de tabel niet zelf stylen."
      },
      "37": {
        "SUMMARY": "Hoeveel kolommen heeft deze tabel?",
        "DESCRIPTION": "Het werkelijke aantal kolommen in de tabel lijkt niet overeen te komen met de codering. Een screenreader zal daardoor iets anders voorlezen dan wat er te zien is. Maak een tabel altijd aan met de tabelfunctie van je kantoorapplicatie. Vermijd het samenvoegen en splitsen van elementen en ga de tabel niet zelf stylen."
      },
      "38": {
        "SUMMARY": "De codering van deze cel klopt niet met hoe hij eruit ziet",
        "DESCRIPTION": "Deze cel is over meer of minder rijen verspreid dan de codering vermeldt. Een screenreader zal de tabel daarom anders voorlezen dan hoe je hem in het document ziet. Vermijd het samenvoegen en splitsen van cellen zoveel mogelijk in tabellen."
      },
      "39": {
        "SUMMARY": "De codering van deze cel komt niet overeen met hoe hij eruit ziet",
        "DESCRIPTION": "Deze cel is over meer of minder kolommen verspreid dan de codering vermeldt. Een screenreader zal de tabel daarom anders voorlezen dan hoe je hem in het document ziet. Vermijd het samenvoegen en splitsen van cellen zoveel mogelijk in tabellen."
      },
      "40": {
        "SUMMARY": "Is dit onderdeel van een lijst?",
        "DESCRIPTION": "Dit ziet eruit als een onderdeel van een lijst, maar is niet als zodanig gecodeerd. Maak lijsten altijd met de lijstenfunctionaliteit van je kantoorsoftware. Maak lijsten niet handmatig op."
      },
      "41": {
        "SUMMARY": "Deze cel lijkt te laag te staan",
        "DESCRIPTION": "De inhoud van deze cel staat lager dan sommige cellen van de volgende rij. De cel staat dus niet waar de codering zegt dat hij moet staan. Maak een tabel altijd aan met de tabelfunctie van je kantoorapplicatie. Vermijd het samenvoegen en splitsen van elementen en ga de tabel niet zelf stylen."
      },
      "42": {
        "SUMMARY": "Deze cel lijkt te hoog te staan",
        "DESCRIPTION": "De inhoud van deze cel staat hoger dan sommige cellen van de volgende rij. De cel staat dus niet waar de codering zegt dat hij moet staan. Maak een tabel altijd aan met de tabelfunctie van je kantoorapplicatie. Vermijd het samenvoegen en splitsen van elementen en ga de tabel niet zelf stylen."
      },
      "43": {
        "SUMMARY": "Deze cel lijkt teveel naar rechts te staan",
        "DESCRIPTION": "De inhoud van deze cel staat meer naar rechts dan sommige cellen van de volgende kolom. De cel staat dus niet waar de codering zegt dat hij moet staan. Maak een tabel altijd aan met de tabelfunctie van je kantoorapplicatie. Vermijd het samenvoegen en splitsen van elementen en ga de tabel niet zelf stylen."
      },
      "44": {
        "SUMMARY": "Deze cel lijkt teveel naar links te staan",
        "DESCRIPTION": "De inhoud van deze cel staat meer naar links dan sommige cellen van de volgende kolom. De cel staat dus niet waar de codering zegt dat hij moet staan. Maak een tabel altijd aan met de tabelfunctie van je kantoorapplicatie. Vermijd het samenvoegen en splitsen van elementen en ga de tabel niet zelf stylen."
      },
      "45": {
        "SUMMARY": "Is dit wel een tabelkop?",
        "DESCRIPTION": "Dit ziet eruit als een gewone tabelcel, maar is gecodeerd als een tabelkop. Maak een tabel altijd aan met de tabelfunctie van je kantoorapplicatie. Beperk koppen tot de eerste rij of eerste kolom. Vermijd het samenvoegen en splitsen van elementen en ga de tabel niet zelf stylen."
      },
      "46": {
	"SUMMARY": "Dit element van de inhoudsopgave komt niet in het document voor",
	"DESCRIPTION": "De tekst van dit element van de inhoudsopgave komt niet overeen met een kop in het document."
      },
      "47": {
	"SUMMARY": "Dit element van de inhoudsopgave verwijst niet naar de juiste pagina",
	"DESCRIPTION": "De tekst van dit element van de inhoudsopgave staat niet op de pagina waarnaar verwezen wordt."
      },
      "48": {
	"SUMMARY": "Dit element van de inhoudsopgave verwijst nergens naar",
	"DESCRIPTION": "Dit element van de inhoudsopgave heeft geen verwijzing naar een pagina."
      },
      "49": {
	"SUMMARY": "Dit element van de inhoudsopgave verwijst naar een een ongeldig paginanummer",
	"DESCRIPTION": "Dit element van de inhoudsopgave heeft geen geldig paginanummer als verwijzing."
      },
      "50": {
	"SUMMARY": "Inhoudsopgave heeft een onlogische nummering",
	"DESCRIPTION": "De nummering van de inhoudsopgave volgt geen logisch patroon, bijvoorbeeld '1, 2, 3,.. of i, ii, iii,..'"
      },
      "51": {
	"SUMMARY": "Deze lijst heeft een vreemde codering",
	"DESCRIPTION": "De codering zegt dat deze lijst uit één punt bestaat, dat zelf weer een lijst is. Dit kan schermlezers in de war brengen en heeft geen toegevoegde waarde."
      },
      "52": {
	"SUMMARY": "Zijn dit verschillende punten in de lijst?",
	"DESCRIPTION": "Het lijkt erop alsof dit verschillende punten zijn die als één punt gecodeerd zijn. Dit kan ervoor zorgen dat schermlezers de lijst niet voorlezen zoals bedoeld was. Zorg dat verschillende punten in de lijst ook als verschillende punten gecodeerd worden. Gebruik alinea-einde (return) voor elk nieuw punt in de lijst. Gebruik geen regeleinden (shift-return) voor een nieuw punt in de lijst."
      },
      "53": {
	"SUMMARY": "Is dit een opmerking?",
	"DESCRIPTION": "Deze tekst ziet eruit als een opmerking, maar is niet als zodanig gecodeerd. Daardoor zal een schermlezer dit niet als opmerking herkennen en als gewone alinea voorlezen. Zorg dat je opmerkingen ook altijd als zodanig opmaakt, zodat ze als opmerking gecodeerd worden."
      },
      "54": {
	"SUMMARY": "Is dit een opmerking?",
	"DESCRIPTION": "Deze tekst ziet eruit als een opmerking, maar is gecodeerd als gewone alinea. Daardoor zal een schermlezer dit niet als opmerking herkennen en als gewone alinea voorlezen. Zorg dat je opmerkingen ook altijd als zodanig opmaakt, zodat ze als opmerking gecodeerd worden."
      }
    },
    "4.1.3": {
      "1": {
        "SUMMARY": "De codering komt niet overeen met de inhoud",
        "DESCRIPTION": "Als de codering niet overeenkomt met de inhoud, zullen screenreaders het document niet in de juiste volgorde of op de juiste manier voorlezen."
      }
    }
  },
  "ISO 14289-1:2014": {
    "5": {
      "1": {
        "SUMMARY": "Het document is niet van het type PDF/UA",
        "DESCRIPTION": "De metadata in het document vermeld niet dat dit document van het type PDF/UA is. Dit is geen probleem als je document verder maar voldoet aan de toegankelijkheidseisen."
      },
      "2": {
        "SUMMARY": "Er is iets mis met de PDF/UA metadata in het document",
        "DESCRIPTION": "De metadata in het document bevat incorrecte gegevens over PDF/UA. Dit is geen probleem als je document verder maar voldoet aan de toegankelijkheidseisen."
      }
    },
    "7.1": {
      "1": {
        "SUMMARY": "De codering maakt geen goed onderscheid tussen inhoud en decoratieve elementen",
        "DESCRIPTION": "Door gebrekkige codering kunnen screenreaders inhoud niet onderscheiden van decoratieve elementen. Dit is waarschijnlijk te wijten aan de applicatie waarmee je dit bestand gemaakt hebt. Probeer dit deel van het document anders te structureren of bewerk het document met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "2": {
        "SUMMARY": "De codering maakt geen goed onderscheid tussen inhoud en decoratieve elementen",
        "DESCRIPTION": "Door gebrekkige codering kunnen screenreaders inhoud niet onderscheiden van decoratieve elementen. Dit is waarschijnlijk te wijten aan de applicatie waarmee je dit bestand gemaakt hebt. Probeer dit deel van het document anders te structureren of bewerk het document met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "3": {
        "SUMMARY": "Het document bevat inhoud die niet gelabeld is in de code",
        "DESCRIPTION": "Als inhoud niet gelabeld is in de code, kunnen screenreaders niet achterhalen hoe het dit document moet voorlezen. Je kan dit mogelijk oplossen door je document nogmaals uit je kantoorapplicatie (Word of LibreOffice) te exporteren als 'tagged' (gelabelde) PDF. In Word doe je dit door in het menu 'Bestand - Opslaan als - (kies PDF) - Opties' de opties 'Labels voor documentstructuur voor toegankelijkheid' en 'Voldoet aan PDF/A' aan te vinken. Gebruik NOOIT 'afdrukken - Adobe PDF' om je document naar PDF te exporteren. Het is ook mogelijk dat je deze fout krijgt als je PDF bestand een gescand document is. Kijk in dat geval of het mogelijk om het document opnieuw te scannen met tekenherkenning (OCR) en check of het goed gecodeerd is."
      },
      "4": {
        "SUMMARY": "De applicatie die dit document creëerde kon geen correcte leesvolgorde garanderen",
        "DESCRIPTION": "Je krijgt deze waarschuwing als de applicatie waarmee het document aangemaakt werd, niet kon garanderen dat de leesvolgorde correct is. Op zich hoeft de leesvolgorde niet fout te zijn. Of er echt een probleem is met de leesvolgorde kan je zien aan andere codefouten die deze checker vindt. Deze waarschuwing kan wel tot gevolg hebben dat screenreaders het document niet accepteren. Om van deze waarschuwing af te komen, kun je proberen het document eenvoudiger te structureren of het document met een andere applicatie te bewerken (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "5": {
        "SUMMARY": "Het document heeft geen standaard codering",
        "DESCRIPTION": "Het document gebruikt een eigen codering die niet te herleiden is tot de standaardcodering. Daardoor kunnen screenreaders het document mogelijk niet goed voorlezen. Dit is waarschijnlijk te wijten aan de applicatie waarmee je dit bestand gemaakt hebt. Probeer het document eenvoudiger te structureren of bewerk het document met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "6": {
        "SUMMARY": "Er zitten circulaire verwijzingen in de codering van het document",
        "DESCRIPTION": "In de codering van het document zitten circulaire verwijzingen. Daardoor kunnen screenreaders het document mogelijk niet goed voorlezen. Dit is waarschijnlijk te wijten aan de applicatie waarmee je dit bestand gemaakt hebt. Probeer het document eenvoudiger te structureren of bewerk het document met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "7": {
        "SUMMARY": "Het document heeft gewijzigde standaardcodering",
        "DESCRIPTION": "De standaardcodering is gewijzigd in dit document. Als er geen standaardcodering wordt gebruikt, kunnen screenreaders het document mogelijk niet goed voorlezen. Dit is waarschijnlijk te wijten aan de applicatie waarmee je dit bestand gemaakt hebt. Probeer het document eenvoudiger te structureren of bewerk het document met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "8": {
        "SUMMARY": "Het document mist essentiële metadata",
        "DESCRIPTION": "Het document heeft geen metadata. Daardoor missen screenreaders essentiële informatie om het voor te kunnen lezen (zoals de voorleestaal). Dit is waarschijnlijk te wijten aan de applicatie waarmee je dit bestand gemaakt hebt. Probeer het document te bewerken met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word) en sla het op als een 'tagged' PDF, bijvoorbeeld in PDF/A-1a of PDF/UA format."
      },
      "9": {
        "SUMMARY": "De titel is niet ingevuld in de documenteigenschappen",
        "DESCRIPTION": "In de metadata van het document mist de titel. Dit komt waarschijnlijk omdat je de titel niet ingevuld hebt in de documenteigenschappen. Let op: het kan gebeuren dat je  document wel een titelpagina of een kop in titel-stijl heeft, en je toch deze fout krijgt. Deze fout gaat namelijk niet over de inhoud maar over de metadata van het document. Om deze fout te vermijden kan documenteigenschappen van je kantoorapplicatie openen (meestal via de Bestand tab van het menu links boven) en daar de titel invullen. Of als je de beschikking hebt over een PDF editor dan kan je de titel daarmee ook invullen."
      },
      "10": {
        "SUMMARY": "De titel van het document is niet zichtbaar in de titelbalk",
        "DESCRIPTION": "De codering van het document zorgt er niet voor dat de titel zichtbaar is in de titelbalk van de reader of browser. Check eerst of de titel is invuld in de documenteigenschappen en vul deze indien nodig in. Dat doe je door de documenteigenschappen van je kantoorapplicatie te openen (meestal via de Bestand tab van het menu links boven) en daar de titel in te vullen. Als je de beschikking hebt over een PDF editor, dan kan je de titel daarmee ook invullen. Krijg je deze fout daarna nog steeds, dan is het probleem waarschijnlijk te wijten aan de applicatie waarmee je dit bestand gemaakt hebt. Probeer dan het document te bewerken met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word). Als je een PDF expert bent, dan kan je het probleem oplossen door met een PDF editor de DisplayDocTitle key op 'true' te zetten in de ViewerPreferences dictionary."
      },
      "11": {
        "SUMMARY": "Het document is niet gecodeerd",
        "DESCRIPTION": "Als het document geen code heeft, kunnen screenreaders het niet in de juiste volgorde voorlezen. Dit is een kritieke fout. Je kan dit waarschijnlijk oplossen door je document nogmaals uit je kantoorapplicatie (Word of LibreOffice) te exporteren als 'tagged' (gelabelde) PDF. In Word doe je dit door in het menu 'Bestand - Opslaan als - (kies PDF) - Opties' de opties 'Labels voor documentstructuur voor toegankelijkheid' en 'Voldoet aan ISO 19005-1 (PDF/A)' aan te vinken. Gebruik nooit 'afdrukken - Adobe PDF' om je document naar PDF te exporteren."
      }
    },
    "7.2": {
      "2": {
        "SUMMARY": "De taal van het document is niet ingesteld",
        "DESCRIPTION": "Voorleesapplicaties moeten weten in welke taal ze dit document moeten voorlezen. Daarvoor moet je de taal van het document instellen. Als je het document hebt aangemaakt met Word of LibreOffice doe je dit door de instellingen van de stijl 'Standaard' te openen en de taal daar in te stellen."
      },
      "3": {
        "SUMMARY": "De tabel bevat zaken die niet in een tabel mogen voorkomen",
        "DESCRIPTION": "Een tabel mag alleen uit rijen, koprijen, voetrijen en een bijschrift bestaan. Uit de codering blijkt dat deze tabel andere elementen heeft die geen deel van een tabel mogen uitmaken. Daardoor kan een schermlezer problemen hebben om de tabel voor te lezen. Probeer de tabel eenvoudiger op te maken zonder complexe onderdelen."
      },
      "4": {
        "SUMMARY": "Deze tekst is verkeerd gemarkeerd als tabelrij",
        "DESCRIPTION": "Deze tekst is gemarkeerd als onderdeel van een tabel, maar de codering geeft niet goed aan van welke tabel dit onderdeel uitmaakt. Als deze tekst bij een tabel hoort of dicht bij een tabel staat, probeer die tabel dan nogmaals op te maken. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word). "
      },
      "5": {
        "SUMMARY": "Deze tekst is verkeerd gemarkeerd als tabel kop",
        "DESCRIPTION": "Deze tekst is gemarkeerd als tabelkop, maar de codering geeft niet goed aan van welke tabel dit onderdeel uitmaakt. Als deze tekst bij een tabel hoort, probeer die tabel dan nogmaals op te maken. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word). "
      },
      "6": {
        "SUMMARY": "Deze tekst is verkeerd gemarkeerd als tabel",
        "DESCRIPTION": "Deze tekst is gemarkeerd als tabel, maar de codering geeft niet goed aan van welke tabel dit onderdeel uitmaakt. Als deze tekst bij een tabel hoort, probeer die tabel dan nogmaals op te maken. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)"
      },
      "7": {
        "SUMMARY": "Deze tekst is verkeerd gemarkeerd als tabel voettekst",
        "DESCRIPTION": "Deze tekst is gemarkeerd als tabel voettekst, maar de codering geeft niet goed aan van welke tabel dit onderdeel uitmaakt. Als deze tekst bij een tabel hoort, probeer die tabel dan nogmaals op te maken. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)"
      },
      "8": {
        "SUMMARY": "Deze tekst is verkeerd gemarkeerd als tabelkopcel",
        "DESCRIPTION": "Deze tekst is gemarkeerd als tabelkopcel, maar het is niet duidelijk bij welke rij in de tabel deze kopcel hoort. Probeer de tabel opnieuw op te maken. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)"
      },
      "9": {
        "SUMMARY": "Deze tekst is verkeerd gemarkeerd als tabelcel",
        "DESCRIPTION": "Deze tekst is gemarkeerd als tabelcel, maar het is niet duidelijk bij welke rij in de tabel de tekst hoort. Probeer de tabel opnieuw op te maken. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)"
      },
      "10": {
        "SUMMARY": "Deze tabelrij bevat elementen die niet bij een tabel horen",
        "DESCRIPTION": "Een tabelrij mag alleen tabelkopcellen of tabelinhoudcellen bevatten. Deze tabelrij bevat andere soorten tekst. Hierdoor kan het zijn dat screenreaders niet weten hoe het deze tabelrij moet voorlezen. Probeer de tabel opnieuw op te maken. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)"
      },
      "11": {
        "SUMMARY": "De tabel heeft meer dan één kop",
        "DESCRIPTION": "Een tabel mag hoogstens één groep rijen hebben die als kop gemarkeerd zijn. Als een tabel meer dan één kop heeft, weten screenreaders niet hoe het deze tabel moet voorlezen. Probeer de tabel opnieuw op te makenen en zorg dat deze maar één koprij heeft."
      },
      "12": {
        "SUMMARY": "De tabel heeft meer dan één voet",
        "DESCRIPTION": "Een tabel mag hoogstens één groep rijen hebben die als voet gemarkeerd zijn. Als een tabel meer dan één voet heeft, weten screenreaders niet hoe het deze tabel moet voorlezen. Probeer de tabel opnieuw op te maken en zorg dat deze maar één voetrij heeft."
      },
      "13": {
        "SUMMARY": "De tabel heeft een voet maar geen body",
        "DESCRIPTION": "Als een tabel een voet heeft, moet deze tenminste ook een body hebben. Probeer de tabel opnieuw op te maken en zorg ervoor dat de tabel behalve een kop en voet ook inhoud heeft. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)"
      },
      "14": {
        "SUMMARY": "De tabel heeft een kop maar geen body",
        "DESCRIPTION": "Als een tabel een kop heeft, moet deze tenminste ook een body hebben. Probeer de tabel opnieuw op te maken en zorg ervoor dat de tabel behalve een kop en voet ook inhoud heeft. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)"
      },
      "15": {
        "SUMMARY": "De rijen in deze tabel hebben niet hetzelfde aantal cellen",
        "DESCRIPTION": "In een tabel moeten de rijen hetzelfde aantal cellen hebben. Probeer de tabel opnieuw op te maken. Cellen samenvoegen mag, maar begin altijd met een basistabel waarin elke rij hetzelfde aantal cellen heeft. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "16": {
        "SUMMARY": "Er is iets mis met het bijschrijft van de tabel",
        "DESCRIPTION": "Het bijschrift van de tabel is verkeerd gecodeerd. Probeer het bijschrift te verwijderen en voeg het opnieuw in. Een tabel mag maar één bijschrift hebben. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "17": {
        "SUMMARY": "Deze tekst is verkeerd gemarkeerd als lijstelement",
        "DESCRIPTION": "Deze tekst is gemarkeerd als lijstelement, maar de codering geeft niet goed aan bij welke lijst dit element hoort. Als deze tekst bij een lijst hoort of dicht bij een lijst staat, probeer de lijst dan nogmaals op te maken. Houd alle lijstelementen goed bij elkaar. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "18": {
        "SUMMARY": "Er is een probleem met de structuur van de lijst",
        "DESCRIPTION": "Deze tekst is gemarkeerd als lijstelement, maar de code geeft niet goed aan hoe deze in de lijst past. Als deze tekst bij een lijst hoort, probeer die lijst dan nogmaals op te maken en houd de lijstelementen goed bij elkaar. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "19": {
        "SUMMARY": "Deze lijst bevat elementen die niet bij een lijst horen",
        "DESCRIPTION": "Een lijst mag alleen een bijschrift, lijstelementen en sublijsten bevatten. Deze lijst bevat andere soorten tekst. Hierdoor kan het zijn dat screenreaders niet weten hoe het deze lijst moet voorlezen. Probeer de lijst opnieuw op te maken. Houd de lijst zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "20": {
        "SUMMARY": "Een lijst item mag alleen bestaan uit een label en de itemtekst",
        "DESCRIPTION": "Dit lijst item bevat andere elementen dan het label (bijvoorbeeld een bullet of nummer) en de itemtekst. Hierdoor kan het zijn dat screenreaders niet weten hoe het deze lijst moet voorlezen. Probeer de lijst opnieuw op te maken. Houd de lijst zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "21": {
        "SUMMARY": "De taal van de vervangende tekst is niet ingesteld",
        "DESCRIPTION": "Waarschijnlijk is de taal van het document niet ingesteld. Screenreaders weten dan niet hoe het de vervangende tekst van deze tekst moet voorlezen. Als je het document hebt aangemaakt met Word of LibreOffice doe je dit door de instellingen van de stijl 'Standaard' te openen en de taal daar in te stellen."
      },
      "22": {
        "SUMMARY": "De taal van de alternatieve tekst is niet ingesteld",
        "DESCRIPTION": "Waarschijnlijk is de taal van het document niet ingesteld. Screenreaders weten dan niet hoe het de alternatieve tekst van dit element moet voorlezen. Als je het document hebt aangemaakt met Word of LibreOffice doe je dit door de instellingen van de stijl 'Standaard' te openen en de taal daar in te stellen."
      },
      "23": {
        "SUMMARY": "De taal van de uitklaptekst van de afkorting is niet ingesteld",
        "DESCRIPTION": "Waarschijnlijk is de taal van het document niet ingesteld. Screenreaders weten dan niet hoe het de uitklaptekst van deze afkorting moet voorlezen. Als je het document hebt aangemaakt met Word of LibreOffice doe je dit door de instellingen van de stijl 'Standaard' te openen en de taal daar in te stellen."
      },
      "24": {
        "SUMMARY": "De taal van dit commentaarveld is niet ingesteld",
        "DESCRIPTION": "Waarschijnlijk is de taal van het document niet ingesteld. Screenreaders weten dan niet hoe het dit commentaarveld moet voorlezen. Als je het document hebt aangemaakt met Word of LibreOffice doe je dit door de instellingen van de stijl 'Standaard' te openen en de taal daar in te stellen."
      },
      "25": {
        "SUMMARY": "De taal van dit formulier is niet ingesteld",
        "DESCRIPTION": "Waarschijnlijk is de taal van het document niet ingesteld. Screenreaders weten dan niet hoe het dit formulier moet voorlezen. Als je het document hebt aangemaakt met Word of LibreOffice doe je dit door de instellingen van de stijl 'Standaard' te openen en de taal daar in te stellend"
      },
      "26": {
        "SUMMARY": "Deze tekst is verkeerd gemarkeerd als onderdeel van de inhoudsopgave",
        "DESCRIPTION": "Als deze tekst bij de inhoudsopgave hoort of dicht bij de inhoudsopgave staat, probeer dan de inhoudsopgave opnieuw aan te maken. Je kan de inhoudsopgave het beste automatisch laten genereren. Bewerk je de inhoudsopgave handmatig, houd dan de elementen van de inhoudsopgave goed bij elkaar. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "27": {
        "SUMMARY": "Er is iets mis met de codering van de inhoudsopgave",
        "DESCRIPTION": "Een inhoudsopgave mag alleen verwijzingen en een bijschrift bevatten, die zo gecodeerd moeten zijn zodat een schermlezer ze kan herkennen. Deze inhoudsopgave bevat andere onderdelen die niet in een inhoudsopgave thuishoren. Een veelgemaakte fout is om verwijzingen in de inhoudsopgave als gewone koppen of alinea's op te maken. Gebruik voor zover mogelijk een automatisch gegenereerde inhoudsopgave en ga deze niet zelf bewerken."
      },
      "28": {
        "SUMMARY": "Er is iets mis met het bijschrift van de inhoudsopgave",
        "DESCRIPTION": "Het bijschrijft van de inhoudsopgave is verkeerd gecodeerd. Probeer het bijschrift te verwijderen en weer toe te voegen. Ga altijd uit van de automatisch gegenereerde inhoudsopgave, ga deze niet zelf bewerken. Lukt het niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "29": {
        "SUMMARY": "Taal van het document verkeerd gecodeerd",
        "DESCRIPTION": "Dit probleem is waarschijnlijk te wijten aan de applicatie waarmee je dit bestand gemaakt hebt. Probeer de taal van het document handmatig in te stellen. Dat doe je in Word of LibreOffice door de instellingen van de stijl 'Standaard' te openen en de taal daar in te stellend. Werkt dat niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "30": {
        "SUMMARY": "De taal van de vervangende tekst is niet ingesteld",
        "DESCRIPTION": "Waarschijnlijk is de taal van het document niet ingesteld. Screenreaders weten dan niet hoe het de vervangende tekst van deze tekst moet voorlezen. Als je het document hebt aangemaakt met Word of LibreOffice doe je dit door de instellingen van de stijl 'Standaard' te openen en de taal daar in te stellen."
      },
      "31": {
        "SUMMARY": "De taal van de alternatieve tekst is niet ingesteld",
        "DESCRIPTION": "Waarschijnlijk is de taal van het document niet ingesteld. Screenreaders weten dan niet hoe het de alternatieve tekst van dit element moet voorlezen. Als je het document hebt aangemaakt met Word of LibreOffice doe je dit door de instellingen van de stijl 'Standaard' te openen en de taal daar in te stellen."
      },
      "32": {
        "SUMMARY": "De taal van de uitklaptekst van de afkorting is niet ingesteld",
        "DESCRIPTION": "Waarschijnlijk is de taal van het document niet ingesteld. Screenreaders weten dan niet hoe het de uitklaptekst van deze afkorting moet voorlezen. Als je het document hebt aangemaakt met Word of LibreOffice doe je dit door de instellingen van de stijl 'Standaard' te openen en de taal daar in te stellen."
      },
      "33": {
        "SUMMARY": "De taal van de metadata van het document is niet ingesteld",
        "DESCRIPTION": "Waarschijnlijk is de taal van het document niet ingesteld. Als je het document hebt aangemaakt met Word of LibreOffice doe je dit door de instellingen van de stijl 'Standaard' te openen en de taal daar in te stellen."
      },
      "34": {
        "SUMMARY": "De taal van deze tekst is niet ingesteld",
        "DESCRIPTION": "Screenreaders weten niet in welke taal het deze tekst moet voorlezen. Waarschijnlijk is de taal van het document niet ingesteld. Als je het document hebt aangemaakt met Word of LibreOffice doe je dit door de instellingen van de stijl 'Standaard' te openen en de taal daar in te stellen."
      },
      "36": {
        "SUMMARY": "De tabelkop bevat elementen die niet bij een kop horen",
        "DESCRIPTION": "Een tabelkop mag alleen uit rijen bestaan. Deze tabelkop bevat andere soorten tekst. Hierdoor kan het zijn dat screenreaders niet weten hoe het deze tabelkop moet voorlezen. Probeer de tabel opnieuw op te maken. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)"
      },
      "37": {
        "SUMMARY": "De body van deze tabel bevat elementen die niet bij een tabel body horen",
        "DESCRIPTION": "De body van een tabel mag alleen uit rijen bestaan. De body van deze tabel bevat andere soorten tekst. Hierdoor kan het zijn dat screenreaders niet weten hoe het deze tabel moet voorlezen. Probeer de tabel opnieuw op te maken. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)"
      },
      "38": {
        "SUMMARY": "De voettekst van deze tabel bevat elementen die niet bij voettekst horen",
        "DESCRIPTION": "De voettekst van een tabel mag alleen uit rijen bestaan. De voettekst van deze tabel bevat andere soorten tekst. Hierdoor kan het zijn dat screenreaders niet weten hoe het deze tabel moet voorlezen. Probeer de tabel opnieuw op te maken. Houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)"
      },
      "39": {
        "SUMMARY": "Deze tabel heeft meer dan één bijschrift",
        "DESCRIPTION": "Een tabel mag volgens WCAG maar één bijschrift hebben. Probeer de bijschriften te verwijderen en voeg er dan weer één toe. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "40": {
        "SUMMARY": "Er is iets mis met het bijschrift van deze lijst",
        "DESCRIPTION": "Het bijschrift van de lijst is verkeerd gecodeerd. Dit kan schermlezers in de war brengen. Probeer het bijschrift te verwijderen en weer in te voegen. Werkt dit niet, probeer het dan nog eens met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.3": {
      "1": {
        "SUMMARY": "Deze figuur heeft geen alternatieve tekst",
        "DESCRIPTION": "Een figuur moet een alternatieve tekst hebben die beschrijft wat de figuur illustreert. In MS Word en LibreOffice kan je alternatieve tekst toevoegen door rechts op de figuur te klikken en dan 'Afbeelding opmaken' (Word) of 'Eigenschappen' (LibreOffice) te kiezen. Alleen als de figuur een decoratieve functie heeft en voor de inhoud van het document niet van belang is, hoeft deze geen alternatieve tekst te hebben en mag je deze foutboodschap negeren."
      }
    },
    "7.4.2": {
      "1": {
        "SUMMARY": "Verkeerd gebruik van koppen",
        "DESCRIPTION": "De koppen worden niet in logische volgorde gebruikt. Dit kan ertoe leiden dat een slechtziende met screenreaders moeite hebben om door het document te navigeren. Om aan WCAG 2.1 te voldoen moet het document altijd beginnen met een kop van niveau 1 en moeten de niveaus van koppen logisch op elkaar volgen van hoog naar laag. Begin het document dus niet met een kop van niveau 2 of 3. Sla geen niveaus van koppen over: laat bijvoorbeeld niet een kop van niveau 3 volgen op een kop van niveau 1."
      }
    },
    "7.4.4": {
      "1": {
        "SUMMARY": "De structuur van het document is verkeerd gecodeerd",
        "DESCRIPTION": "Dit is een probleem in de code van het PDF bestand waardoor een slechtziende met een screenreader moeite kan hebben om door het document te navigeren. Het probleem is waarschijnlijk te wijten aan de applicatie waarmee je dit bestand gemaakt hebt. Je kan proberen dit op te lossen door het document te voorzien van koppen met stijl Kop 1, Kop 2, enz. Werkt dit niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "2": {
        "SUMMARY": "De koppenstructuur is verkeerd gecodeerd",
        "DESCRIPTION": "Dit is een probleem met de codering van koppen waardoor een slechtziende met een screenreader moeite kan hebben om door het document te navigeren. Probeer dit probleem op te lossen door het document te voorzien van koppen met stijl Kop 1, Kop 2, enz. Werkt dit niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "3": {
        "SUMMARY": "De koppenstructuur is verkeerd gecodeerd",
        "DESCRIPTION": "Dit is een probleem met de codering van koppen waardoor een slechtziende met een screenreader moeite kan hebben om door het document te navigeren. Probeer dit probleem op te lossen door het document te voorzien van koppen met stijl Kop 1, Kop 2, enz. Werkt dit niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.5": {
      "1": {
        "SUMMARY": "De code beschrijft de structuur van deze tabel onvoldoende",
        "DESCRIPTION": "Deze tabel mist code waaruit de structuur kan worden opgemaakt. Daardoor hebben screenreaders moeite om de tabel correct voor te lezen. Probeer de tabel opnieuw op te maken, geef de tabel duidelijke kop-rij of kop-kolom en houd de tabel zo eenvoudig mogelijk. Werkt dit niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.7": {
      "1": {
        "SUMMARY": "Deze formule heeft geen alternatieve tekst",
        "DESCRIPTION": "Formules moeten als zodanig gemarkeerd zijn en voorzien zijn van alternatieve tekst. In Word kan je een formule maken door in het menu Invoegen - Symbool/Vergelijking te kiezen. In LibreOffice kan dit door Invoegen - Object - Formule te kiezen. Je kan daar ook de alternatieve tekst voor de formule ingeven. Lukt het niet, dan kan je als laatste redmiddel de formule als figuur invoegen en de figuur voorzien van alternatieve tekst."
      }
    },
    "7.9": {
      "1": {
        "SUMMARY": "Deze noot is niet goed gecodeerd",
        "DESCRIPTION": "Deze noot heeft geen eenduidige referentie in de documentcode. Daardoor kunnen screenreaders moeite hebben om door het document te navigeren. Voor digitale toegankelijkheid kan je noten het beste helemaal vermijden omdat ze de leesvolgorde onderbreken. Moet je toch echt met noten werken, gebruik hier dan de functionaliteit voor die je kantoorapplicatie biedt voor voetnoten, eindnoten of verwijzingen. Lost dit het probleem niet op, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "2": {
        "SUMMARY": "Er is een probleem met de indexering van noten en verwijzingen",
        "DESCRIPTION": "In het document zijn conflicterende verwijzingen gevonden. Daardoor kunnen screenreaders niet goed overweg met de noten en verwijzingen in het document. Voor digitale toegankelijkheid kan je noten het beste helemaal vermijden omdat ze de leesvolgorde onderbreken. Moet je toch echt met noten werken, gebruik hier dan de functionaliteit voor die je kantoorapplicatie biedt voor voetnoten, eindnoten of verwijzingen. Lost dit het probleem niet op, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.10": {
      "1": {
        "SUMMARY": "Een documentlaag heeft geen naam",
        "DESCRIPTION": "Dit PDF bestand bestaat uit één of meer lagen die niet goed geïdentificeerd zijn. Dit ze fout wordt waarschijnlijk veroorzaakt door de kantoorapplicatie die je hebt gebruikt om het document mee te maken. Je kan proberen dit probleem op te lossen door het document te vereenvoudigen.Als je met PDF tools overweg kan, kun je dit oplossen door de lagen van het document te verwijderen ('merge' of 'flatten' layers)."
      },
      "2": {
        "SUMMARY": "Een documentlaag kan de leesbaarheid negatief beïnvloeden",
        "DESCRIPTION": "Dit PDF bestand bestaat uit één of meer lagen die de leesbaarheid nadelig kunnen beïnvloeden. Dit ze fout kan veroorzaakt zijn door de kantoorapplicatie die je hebt gebruikt om het document mee te maken. Je kan proberen dit probleem op te lossen door het document te vereenvoudigen. Als je met PDF tools overweg kan, kun je dit oplossen door de lagen van het document te verwijderen (flatten layers)."
      }
    },
    "7.11": {
      "1": {
        "SUMMARY": "Het bijgevoegde bestand heeft geen geldige naam",
        "DESCRIPTION": "Als je een bestand als bijlage in een PDF document invoegt, moet dit via de code toegankelijk zijn. Het bijgevoegde bestand is in de code niet voorzien van een naam en/of beschrijving. Om dit probleem op te lossen moet je het bijgevoegde bestand van een naam en beschrijving voorzien. Lukt dit niet, dan kan je als laatste redmiddel de bijlage verwijderen en als apart bestand meesturen met het document."
      }
    },
    "7.15": {
      "1": {
        "SUMMARY": "Het document bevat een interactief formulier",
        "DESCRIPTION": "Om te voldoen aan toegankelijkheidseisen mag het document geen interactieve XFA (XML Forum Architecture) formulieren bevatten. Bewerk het formulier en maak er een statisch formulier van. Je kan ook proberen het formulier in een ander format dan XFA op te nemen, als je applicatie dat toelaat."
      }
    },
    "7.16": {
      "1": {
        "SUMMARY": "Dit document is versleuteld en daardoor niet meer digitaal toegankelijk",
        "DESCRIPTION": "Als je een document versleutelt, moet dat gebeuren op een manier die digitale toegankelijkheid ondersteunt. Dat is niet het geval in dit document. Haal de versleuteling van dit document, versleutel het document op een manier die de digitale toegankelijkheid niet in de weg staat. Sommige gangbare PDF applicaties ondersteunen dit."
      }
    },
    "7.18.1": {
      "1": {
        "SUMMARY": "Deze annotatie is verkeerd gemarkeerd",
        "DESCRIPTION": "Omdat deze annotatie niet correct gemarkeerd is in de code, kunnen screenreaders de annotatie mogelijk niet goed vinden of voorlezen. Dit probleem is waarschijnlijk te wijten aan de applicatie waarmee je het document gemaakt hebt. Probeer de annotatie te verwijderen en daarna weer toe te voegen, of probeer het met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "2": {
        "SUMMARY": "Deze annotatie heeft geen alternatieve tekst",
        "DESCRIPTION": "Een annotatie moet tekstinhoud of een alternatieve tekst hebben (dit geldt niet voor links, widgets, pop-ups en verborgen annotaties). Voeg tekstinhoud of alternatieve tekst toe aan deze annotatie."
      },
      "3": {
        "SUMMARY": "Alternatieve beschrijving mist voor dit formulierveld",
        "DESCRIPTION": "Een invulveld dat niet verborgen is moet een alternatieve beschrijving hebben. Dit kan ertoe leiden dat iemand die een screenreader gebruikt, moeite heeft om het formulier in te vullen. Voeg een alternatieve tekst toe OF zorg dat alle widget annotaties van dit veld alternatieve teksten hebben."
      }
    },
    "7.18.2": {
      "1": {
        "SUMMARY": "Het document bevat annotaties voor het corrigeren van kleuren bij afdrukken",
        "DESCRIPTION": "Een document mag geen zogenaamde 'trapping annotaties' hebben die bedoeld zijn om kleuren te corrigeren bij het afdrukken. Verwijder deze annotaties of zet de 'trapping' opties uit in de applicatie waarmee je dit document gemaakt hebt."
      }
    },
    "7.18.3": {
      "1": {
        "SUMMARY": "De annotaties hebben geen duidelijke navigatievolgorde",
        "DESCRIPTION": "De navigatievolgorde van annotaties moet beschreven zijn in de documentcode. Hier is dat niet in orde. Waarschijnlijk is dit te wijten aan de applicatie waarmee je het document gemaakt hebt. Probeer de annotaties te verwijderen en weer toe te voegen in de logische leesvolgorde. Werkt dit niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.18.4": {
      "1": {
        "SUMMARY": "Er is iets mis met de code van dit interactieve formulier",
        "DESCRIPTION": "Interactieve formulieren geven vaak problemen, en kan je beter vermijden. Gebruik je toch een interactief formulier, dan moet dat op de juiste manier door je applicatie gecodeerd zijn zodat screenreaders weten hoe het ermee om moet gaan. Verwijder het formulier en probeer het weer toe te voegen, of probeer het met een andere applicatie."
      },
      "2": {
        "SUMMARY": "Dit onderdeel van het formulier is niet juist gecodeerd",
        "DESCRIPTION": "De codering beschrijft niet duidelijk hoe dit onderdeel van het formulier moet worden gebruikt. Daardoor kan een screenreader er mogelijk niet mee overweg. Probeer om dit onderdeel van het formulier anders te implementeren, bijvoorbeeld een drop-downmenu in plaats van een tekstvak."
      }
    },
    "7.18.5": {
      "1": {
        "SUMMARY": "Deze verwijzing is verkeerd gemarkeerd in de code van het document",
        "DESCRIPTION": "Dit is een codefout die veel voorkomt in inhoudsopgaven met links naar de hoofdstukken. Als de inhoudsopgave automatisch door je kantoorapplicatie gegenereerd is, kan je hier niet veel aan doen behalve de inhoudsopgave weghalen of handmatig te proberen te maken. Dit is gelukkig geen ernstige fout omdat veel voorleesapplicaties hier wel mee overweg kunnen."
      },
      "2": {
        "SUMMARY": "Deze link heeft geen alternatieve beschrijving",
        "DESCRIPTION": "Een hyperlink moet een duidelijke beschrijving hebben van de bestemming waar hij naar verwijst. Als de link onder een stukje tekst staat die duidelijk de bestemming beschrijft, dan mag je deze waarschuwing negeren. Als de link in de tekst staat uitgeschreven of onder een afbeelding staat, dan moet je hem voorzien van alternatieve tekst. Zet geen lange URLs in je document zonder alternatieve tekst."
      }
    },
    "7.18.6.2": {
      "1": {
        "SUMMARY": "Het type van deze media clip is niet correct beschreven in de code van het document",
        "DESCRIPTION": "Media clips moeten in de code van het document een gestandaardiseerde beschrijving van het type media hebben. Anders weten screenreaders niet wat het met de media clip moet doen. Deze fout is waarschijnlijk te wijten aan de applicatie waarmee je het document gemaakt hebt. Probeer de media clip te verwijderen en expliciet als audio of video toe te voegen. Werkt dat niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "2": {
        "SUMMARY": "Deze mediaclip heeft geen alternatieve beschrijving",
        "DESCRIPTION": "Media clips moeten voorzien zijn van een altervatieve beschrijving. Anders weten mensen die de media clip niet kunnen zien of horen niet wat de inhoud ervan is. Voeg dus een alternatieve beschrijving toe aan de media clip."
      }
    },
    "7.18.8": {
      "1": {
        "SUMMARY": "Afrukmarkeringen zijn niet als zodanig gemarkeerd",
        "DESCRIPTION": "Afdrukmarkeringen moeten gemarkeerd zijn als grafische informatie die geen deel uitmaken van de documentinhoud. In dit geval zijn de afdrukmarkeringen verkeerd gemarkeerd waardoor het lijkt of ze bij de inhoud horen. Hierdoor kunnen screenreaders in de war raken. Verwijder de markeringen en voeg ze opnieuw toe met de functionaliteit die je applicatie daarvoor heeft (in Word via Bestand - Opties - Geavanceerd - Bijsnijdmarkeringen). Lukt dat niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.20": {
      "1": {
        "SUMMARY": "Het document heeft een extern bestand als onderdeel",
        "DESCRIPTION": "Een document mag niet naar externe bestanden refereren als onderdeel van de documentinhoud. Dit maakt het voor voorleesapplicaties bijzonder moeilijk om de logische structuur van het document te achterhalen. Haal deze referenties naar externe bestanden uit het document."
      },
      "2": {
        "SUMMARY": "Herbruikbare documentelementen zijn niet correct gecodeerd",
        "DESCRIPTION": "Dit document bevat hebruikbare documentelementen (zogenaamde XObjects) die niet correct gecodeerd zijn. Daarom kunnen screenreaders er niet goed mee overweg. Dit probleem is waarschijnlijk te wijten aan de applicatie waarmee je het document gemaakt hebt. Kijk of er in je document zich herhalende figuren of teksten voorkomen. Hier kan het probleem uit voortkomen. Probeer deze herhalende elementen dan op een andere manier of met een andere applicatie in te voegen."
      }
    },
    "7.21.3.1": {
      "1": {
        "SUMMARY": "Er is een probleem met de codering van een lettertype. Dit betreft lettertype(n): ",
        "DESCRIPTION": "Dit is een technisch probleem met de codering van het lettertype dat ingesloten is in het document. Probeer dit probleem op te lossen door een ander lettertype te gebruiken. Kies een zo standaard mogelijk lettertype, bijvoorbeeld Arial of Times New Roman. Lukt dat niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.21.3.2": {
      "1": {
        "SUMMARY": "Er is een probleem met de codering van een lettertype. Dit betreft lettertype(n): ",
        "DESCRIPTION": "Dit is een technisch probleem met de codering van het schaalbare lettertype dat ingesloten is in het document. Probeer dit probleem op te lossen door een ander lettertype te gebruiken. Kies een zo standaard mogelijk lettertype, bijvoorbeeld Arial of Times New Roman. Lukt dat niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.21.3.3": {
      "1": {
        "SUMMARY": "Het document mist de codering van een lettertype. Dit betreft lettertype(n): ",
        "DESCRIPTION": "Het lettertype heeft een niet-standaard codering die niet in het document is opgenomen. Probeer dit probleem op te lossen door een ander lettertype te gebruiken. Kies een zo standaard mogelijk lettertype, bijvoorbeeld Arial of Times New Roman. Lukt dat niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "2": {
        "SUMMARY": "Een lettertype heeft geen eenduidige schrijfrichting. Dit betreft lettertype(n): ",
        "DESCRIPTION": "De codering van dit lettertype definiëert tegenstrijdige schrijfrichtingen voor verschillende letters en symbolen. Dit is een technisch probleem met de codering van het  lettertype dat ingesloten is in het document. Probeer dit probleem op te lossen door een ander lettertype te gebruiken. Kies een zo standaard mogelijk lettertype, bijvoorbeeld Arial of Times New Roman. Lukt dat niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "3": {
        "SUMMARY": "Een lettertype is niet gecodeerd op een standaard manier. Dit betreft lettertype(n): ",
        "DESCRIPTION": "Dit is een technisch probleem met de codering van het  lettertype dat ingesloten is in het document. Probeer dit probleem op te lossen door een ander lettertype te gebruiken. Kies een zo standaard mogelijk lettertype, bijvoorbeeld Arial of Times New Roman. Lukt dat niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.21.4.1": {
      "1": {
        "SUMMARY": "Een gebruikt lettertype is niet in het document ingesloten. Dit betreft lettertype(n): ",
        "DESCRIPTION": "Alle lettertypen die in het document gebruikt worden, moeten in het document ingesloten zijn. Dit garandeert dat een document altijd correct kan worden weergegeven zonder afhankelijkheden van specifieke readers. Dit specifieke lettertype is niet in het document opgenomen. Om dit op te lossen kan je proberen het document op te slaan als een PDF/A-1a, PDF/A-2a of PDF/UA bestand. Lukt dat niet, kies dan een ander lettertype, liefst zo standaard mogelijk zoals Arial of Times New Roman. Lukt dat ook niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "2": {
        "SUMMARY": "Een lettertype bevat niet alle letters of symbolen die in het document gebruikt worden. Dit betreft lettertype(n): ",
        "DESCRIPTION": "Het ingesloten lettertype is incompleet. Om dit op te lossen kan je proberen het document op te slaan als een PDF/A-1a, PDF/A-2a of PDF/UA bestand. Lukt dat niet, kies dan een ander lettertype, liefst zo standaard mogelijk zoals Arial of Times New Roman. Lukt dat ook niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.21.4.2": {
      "1": {
        "SUMMARY": "Er is iets mis met de codering van een lettertype. Dit betreft lettertype(n): ",
        "DESCRIPTION": "De code beschrijft niet alle letters en symbolen waar het lettertype uit bestaat. Om dit op te lossen kan je proberen het document op te slaan als een PDF/A-1a, PDF/A-2a of PDF/UA bestand. Lukt dat niet, kies dan een ander lettertype, liefst zo standaard mogelijk zoals Arial of Times New Roman. Lukt dat ook niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "2": {
        "SUMMARY": "Er is iets mis met de codering van een lettertype. Dit betreft lettertype(n):  ",
        "DESCRIPTION": "De code beschrijft niet alle letters en symbolen waar het lettertype uit bestaat. Om dit op te lossen kan je proberen het document op te slaan als een PDF/A-1a, PDF/A-2a of PDF/UA bestand. Lukt dat niet, kies dan een ander lettertype, liefst zo standaard mogelijk zoals Arial of Times New Roman. Lukt dat ook niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.21.5": {
      "1": {
        "SUMMARY": "Een lettertype heeft geen eenduidige letterbreedte. Dit betreft lettertype(n): ",
        "DESCRIPTION": "De codering van dit lettertype definiëert tegenstrijdige letterbreedten, waardoor een reader problemen kan hebben om tekst goed weer te geven. Dit is een technisch probleem met de codering van het lettertype dat ingesloten is in het document. Probeer dit probleem op te lossen door een ander lettertype te gebruiken. Kies een zo standaard mogelijk lettertype, bijvoorbeeld Arial of Times New Roman. Lukt dat niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.21.6": {
      "1": {
        "SUMMARY": "Er is iets mis met de codering van een lettertype. Dit betreft lettertype(n):  ",
        "DESCRIPTION": "De codering van dit lettertype maakt het niet mogelijk om de weergave van alle lettertypen op te zoeken. Dit is een technisch probleem met de codering van het lettertype dat ingesloten is in het document. Probeer dit probleem op te lossen door een ander lettertype te gebruiken. Kies een zo standaard mogelijk lettertype, bijvoorbeeld Arial of Times New Roman. Lukt dat niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "2": {
        "SUMMARY": "Er is iets mis met de codering van een lettertype. Dit betreft lettertype(n):  ",
        "DESCRIPTION": "Lettertypen moeten op een standaard manier gecodeerd zijn, anders kan een reader problemen hebben om de letters correct weer te geven. In dit geval voldoet de codering niet aan de standaard vereist voor digitale toegankelijkheid. Dit is een technisch probleem met de codering van het lettertype dat ingesloten is in het document. Probeer dit probleem op te lossen door een ander lettertype te gebruiken. Kies een zo standaard mogelijk lettertype, bijvoorbeeld Arial of Times New Roman. Lukt dat niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "3": {
        "SUMMARY": "Er is iets mis met de codering van symbolen. Dit betreft lettertype(n): ",
        "DESCRIPTION": "De codering van deze symbolen voldoet niet aan de standaard vereist voor digitale toegankelijkheid. Daardoor kunnen readers de symbolen mogelijk niet correct weergeven. Dit is een technisch probleem met de codering van het symbolen-lettertype dat ingesloten is in het document. Probeer dit probleem op te lossen door een ander lettertype te gebruiken voor de symbolen. Kies een zo standaard mogelijk symbolen-lettertype, bijvoorbeeld Wingdings. Lukt dat niet, probeer het dan met een andere applicatie of probeer de symbolen helemaal te vermijden."
      },
      "4": {
        "SUMMARY": "Er is iets mis met de codering van symbolen. Dit betreft lettertype(n): ",
        "DESCRIPTION": "Deze symbolen zijn niet op een eenduidige manier gecodeerd. Daardoor kunnen readers niet bepalen welk symbool ze moeten afbeelden. Dit is een technisch probleem met de codering van het symbolen-lettertype dat ingesloten is in het document. Probeer dit probleem op te lossen door een ander lettertype te gebruiken voor de symbolen. Kies een zo standaard mogelijk symbolen-lettertype, bijvoorbeeld Wingdings. Lukt dat niet, probeer het dan met een andere applicatie of probeer de symbolen helemaal te vermijden."
      }
    },
    "7.21.7": {
      "1": {
        "SUMMARY": "Een letter heeft geen standaard codering. Dit betreft lettertype(n): ",
        "DESCRIPTION": "Om geschikt te zijn voor voorleesapplicaties moeten alle lettertypen in het document een standaard Unicode codering hebben. Dat is hier niet het geval. Zorg eerst dat je het document naar PDF exporteert met Unicode codering. Dat kan bijvoorbeeld door het document te exporteren als PDF/UA, PDF/A-1a of PDF/A-2a. Lost dit het probleem niet op, probeer dan een ander lettertype te gebruiken. Kies een zo standaard mogelijk lettertype, bijvoorbeeld Arial of Times New Roman. Lukt dat ook niet, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      },
      "2": {
        "SUMMARY": "Een letter heeft een ongeldige codering. Dit betreft lettertype(n): ",
        "DESCRIPTION": "Om geschikt te zijn voor voorleesapplicaties moeten alle lettertypen in het document een standaard Unicode codering hebben. De Unicode codering van deze letter is ongeldig. Dit probleem is waarschijnlijk te wijten aan het lettertype dat je gebruikt, of de applicatie waarmee je de PDF hebt geëxporteerd. Probeer een ander lettertype te gebruiken. Kies een zo standaard mogelijk lettertype, bijvoorbeeld Arial of Times New Roman. Exporteer het document als PDF/UA, PDF/A-1a of PDF/A-2a. Lost dit het probleem niet op, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    },
    "7.21.8": {
      "1": {
        "SUMMARY": "Het document bevat ongedefinieerde letters. Dit betreft lettertype(n): ",
        "DESCRIPTION": "Een document mag geen ongedefinieerde letters of symbolen bevatten. Screenreaders weten niet wat ze hiermee aan moeten. Als je weet om welke letter(s) het gaat, haal deze dan uit het document. Of probeer een ander lettertype te gebruiken. Kies een zo standaard mogelijk lettertype, bijvoorbeeld Arial of Times New Roman. Lost dit het probleem niet op, probeer het dan met een andere applicatie (bijvoorbeeld LibreOffice in plaats van Word)."
      }
    }
  }
}
