{
  "WCAG2.1": {
    "1.3.1": {
      "1": {
	"SUMMARY": "Is this meant to be a line or figure?",
	"DESCRIPTION": "There are many repeated occurrences of the same character in this line. Beware that reader software for people with visual impairments will read these out one by one. This can be confusing and annoying for the reader. If you were trying to make a line, figure or form then insert a real line of figure. Don't use repeated underscores, dashes or other characters."
      },
      "2": {
	"SUMMARY": "Avoid repeated white space",
	"DESCRIPTION": "This line contains repeated white spaces. Did you use these to align text? Then it's better to set paragraph indentation instead. Or to use tabs. If the white spaces occur at the end of the line, they probably have no use. In that case it's better to delete them."
      },
      "3": {
	"SUMMARY": "Avoid underlining text",
	"DESCRIPTION": "Underlined text is not forbidden, but easily confused with a hyperlink. It's therefore better to avoid underlining text. If you want to emphasize text, better use boldface."
      },
      "4": {
	"SUMMARY": "Does this text have a specific meaning?",
	"DESCRIPTION": "This text looks different from the surrounding text. If you formatted this text differently to convey a specific meaning, make sure this is also reflected in the code. You can do this for example by creating a style for this text format."
      }
    },
    "1.3.4": {
      "1": {
        "SUMMARY": "The document contains pages in both landscape and portrait orientation",
        "DESCRIPTION": "Make all pages in either landscape or portrait orientation. Don't mix pages with different orientation unless this is essential for the information you need to communicate."
      }
    },
    "1.4.3": {
      "1": {
        "SUMMARY": "Insufficient text contrast",
        "DESCRIPTION": "Text must have sufficient contrast with the background, otherwise people with visual impairments and colorblind people may have problems reading it. Black text on an (almost) white background is usually the safest option. Should you want to use colour, make sure the text has a contrast of at least 4,5 : 1 with the background (for very big text this may be 3 : 1)."
      }    
    },
    "1.4.4": {
      "1": {
	"SUMMARY": "This text size is very small",
	"DESCRIPTION": "This text is so small that people with visual impairments may have problems reading it, even after magnifying. Try using fonts with a size of 11pt or more wherever possible."
      }
    },
    "1.4.8": {
      "1": {
	"SUMMARY": "The document contains fonts that are difficult to read. This concerns font(s): ",
	"DESCRIPTION": "You're using fonts that are difficult to read. Reader software will read the text out correctly, but people with impaired vision, ADHD or people in the autism spectrum may have problems reading this. Unless you meant this text to be unreadable, use standard fonts such as Arial, Verdana or Times Roman."
      }
    },
    "1.4.10": {
      "1": {
	"SUMMARY": "This figure has not been coded correctly",
	"DESCRIPTION": "This figure is not coded with a bounding box. This may affect PDF readers' abililties to reflow the pages of the document."
      }
    },
    "2.4.9": {
      "1": {
	"SUMMARY": "This link does not have a clear description",
	"DESCRIPTION": "This link does not have an alternative description. Beware that reader software will read this URL out in full. This can be awkward for people with visual impairments. Avoid writing out long URLs in the text. Place them as links under explanatory text OR provide an alternative description."
      }
    },
    "4.1.1": {
      "1": {
	"SUMMARY": "This table body contains merged cells",
	"DESCRIPTION": "Merged cells in the table body make it more difficult for reader software to read a table out coherently. Please keep tables as simple as possible and avoid merging cells where you can."
      },
      "2": {
	"SUMMARY": "This table head contains merged cells",
	"DESCRIPTION": "Merged cells in the table head make it more difficult for reader software to read a table out coherently. Please keep tables as simple as possible and avoid merging cells where you can."
      },
      "3": {
	"SUMMARY": "This table appears to have merged cells",
	"DESCRIPTION": "Merged cells in the table head make it more difficult for reader software to read a table out coherently. Please keep tables as simple as possible and avoid merging cells where you can."
      },
      "4": {
	"SUMMARY": "Document is not tagged",
	"DESCRIPTION": "This is a critical accessibility error. If the document has content that is not tagged, reader software for people with visual impairments may have difficulty reading the document out in the right order. You can probably solve this problem by re-exporting your document from your office application (Word or LibreOffice) as tagged PDF. You do this by following the menu 'File -> Save as -> (select PDF) -> Options' and ticking the options 'Tagged PDF' and 'Save as ISO 90005-1 (PDF/A)'."
      }
    },
    "4.1.2": {
      "1": {
        "SUMMARY": "Shouldn't these be different paragraphs?",
        "DESCRIPTION": "This text is tagged as a single paragraph, but it appears as though it should be several paragraphs. Avoid the use of line breaks as much as possible. Use paragraph breaks instead. And consider making each line with different formatting a different paragraph."
      },
      "2": {
        "SUMMARY": "Incorrect use of Span tag",
        "DESCRIPTION": "The content is not identified as a single span of text"
      },
      "3": {
        "SUMMARY": "Is this really a table?",
        "DESCRIPTION": "This text is tagged as a table, but it doesn't appear to be a real table. Avoid using tables to align or format text in a document. Reformat this text as a paragraph. Use tabs to align and borders to format text in a paragraph. Best of all, use styles to consistently align and format text throughout the document."
      },
      "4": {
        "SUMMARY": "Is this really a heading?",
        "DESCRIPTION": "This text is tagged as a heading but doesn't appear to be intended as one. If you didn't intend this as a heading, then make sure it isn't tagged as such. In this case just make it a paragraph in a standard style."
      },
      "5": {
        "SUMMARY": "Is this really a heading?",
        "DESCRIPTION": "This text is tagged as a heading but doesn't appear to be intended as one. If you didn't intend this as a heading, then make sure it isn't tagged as such. In this case just make it a paragraph in a standard style."
      },
      "6": {
        "SUMMARY": "Is this a table row?",
        "DESCRIPTION": "This text appears to be a table row but is not tagged as such. Never format tables manually as this confuses reader applications for people with visual impairments. Always use the insert -> table menu in your office application. This ensures that tables are recognised as such."
      },
      "7": {
        "SUMMARY": "Is this a table head?",
        "DESCRIPTION": "This text appears to be a table head but is not tagged as such. Never format tables manually as this confuses reader applications for people with visual impairments. Always use the insert -> table menu in your office application. This ensures that tables are recognised as such."
      },
      "8": {
        "SUMMARY": "Is this a table cell?",
        "DESCRIPTION": "This text appears to be a table cell but is not tagged as such. Never format tables manually as this confuses reader applications for people with visual impairments. Always use the insert -> table menu in your office application. This ensures that tables are recognised as such."
      },
      "9": {
        "SUMMARY": "Is this a table?",
        "DESCRIPTION": "This appears to be a table but is not tagged as such. Never format tables manually as this confuses reader applications for people with visual impairments. Always use the insert -> table menu in your office application. This ensures that tables are recognised as such."
      },
      "10": {
        "SUMMARY": "Is this a heading?",
        "DESCRIPTION": "This line appears to be intended as a heading, but is not tagged as such. Make sure to use heading styles (Heading 1, Heading 2, Heading 3, etc) to format headings. This allows reader applications for people with visual disabilities to recognise headings and help people navigate the document. If you don't like the way standard heading styles you can change the way they are formatted."
      },
      "11": {
        "SUMMARY": "Should this be a new paragraph?",
        "DESCRIPTION": "This line doesn't appear to be intended as a new paragraph. Avoid unnecessary paragraph breaks in your document."
      },
      "12": {
        "SUMMARY": "Shouldn't this be a paragraph?",
        "DESCRIPTION": "This text appears to be intended as a paragraph but is not tagged as such. Make sure to format text as paragraphs, for example with the Standard style or another paragraph styles."
      },
      "13": {
        "SUMMARY": "Is this a heading?",
        "DESCRIPTION": "This line appears to be intended as a heading, but is not tagged as such. Make sure to use heading styles (Heading 1, Heading 2, Heading 3, etc) to format headings. This allows reader applications for people with visual disabilities to recognise headings and help people navigate the document. If you don't like the way standard heading styles you can change the way they are formatted."
      },
      "14": {
        "SUMMARY": "Is this really a heading?",
        "DESCRIPTION": "This text is tagged as a heading but appears to be intended as a normal paragraph. If this is not a heading, make sure it's not formatted and tagged as such. Format it as a paragraph instead, for example using the Standard paragraph style."
      },
      "15": {
        "SUMMARY": "Is this really a heading?",
        "DESCRIPTION": "This text is tagged as a heading but appears to be intended as a normal paragraph. If this is not a heading, make sure it's not formatted and tagged as such. For example, by using the Standard paragraph style."
      },
      "16": {
        "SUMMARY": "Empty paragraph",
        "DESCRIPTION": "This appears to be an empty paragraph. Avoid paragraphs without text, as this can confuse reader applications for people with visual impairments. Never use paragraphs to create vertical white space. You can create vertical white space by opening the 'Paragraph' menu and adapting the settings for 'Indents and spacing'."
      },
      "17": {
        "SUMMARY": "Empty text element",
        "DESCRIPTION": "This text appears to be empty. Avoid lines without text as this can confuse reader applications for people with visual impairments. Never use empty lines to create vertical white space. You can create vertical white space by opening the 'Paragraph' menu and adapting the settings for 'Indents and spacing'."
      }, 
      "18": {
        "SUMMARY": "Empty heading",
        "DESCRIPTION": "This heading appears to be empty. Avoid headings without text as this can confuse reader applications for people with visual impairments. Never use empty headings to create vertical white space. You can create vertical white space by opening the 'Paragraph' menu and adapting the settings for 'Indents and spacing'."
      },
      "19": {
        "SUMMARY": "Empty heading",
        "DESCRIPTION": "This heading appears to be empty. Avoid headings without text as this can confuse reader applications for people with visual impairments. Never use empty headings to create vertical white space. You can create vertical white space by opening the 'Paragraph' menu and adapting the settings for 'Indents and spacing'."
      },
      "20": {
        "SUMMARY": "Is this a figure or table caption?",
        "DESCRIPTION": "This text appears to be intended as a caption for the figure or table. Make sure to format captions as part of the figure or table itself. You can do this in Word and LibreOffice by right clicking on the figure or table and selecting 'Insert caption'."
      },      
      "21": {
        "SUMMARY": "Is this a list?",
        "DESCRIPTION": "This text appears to be intended as a list, but is not formatted and tagged as such. Avoid formatting lists manually, use the list functionality of your Office application instead."
      },
      "22": {
	"SUMMARY": "Are you sure this is intended as a list?",
	"DESCRIPTION": "This text is tagged as a list but it doesn't appear to be a real list. If this text wasn't intended as a list, then format it as a normal paragraph. It's also possible that you got this warning because you interrupted a list with normal text paragraphs. It's better to avoid this as reader applications can have difficulties reading this out properly."
      },
      "23": {
	"SUMMARY": "Is this really part of a list?",
	"DESCRIPTION": "This text is tagged as a list item but doesn't appear to be part of a real list. This can confuse reader applications. Don't use list functionality with the sole purpose of aligning text, and don't interrupt lists with line breaks of paragraphs."
      },
      "25": {
	"SUMMARY": "Is this really a list?",
	"DESCRIPTION": "This text is tagged as a list item but doesn't appear to be part of a real list. This can confuse reader applications. Don't use list functionality with the sole purpose of aligning text, and don't interrupt lists with line breaks of paragraphs."
      },
      "26": {
	"SUMMARY": "Is this a table?",
	"DESCRIPTION": "This text looks like a table but it's tagged as a list. If you intended this to be a table it's better to format it as such."
      }
    },
    "4.1.3": {
      "1": {
        "SUMMARY": "This content is inappropriately tagged",
        "DESCRIPTION": "If content is not appropriately tagged, reader applications for people with visual impairments will not read the document in the correct way or order."
      }
    }
  },
  "ISO 14289-1:2014": {
    "5": {
      "1": {
        "SUMMARY": "The document is not of the type PDF/UA",
        "DESCRIPTION": "The metadata in the document does not declare it to be of type PDF/UA. This is not a problem as long as your document is accessible."
      },
      "2": {
        "SUMMARY": "There is something wrong with the PDF/UA metadata in this document",
        "DESCRIPTION": "The metadata in the document contains incorrect information on PDF/UA. This is not a problem as long as your document is accessible."
      }
    },
    "7.1": {
      "1": {
        "SUMMARY": "The coding of  this document does not distinguish content from decorative elements",
        "DESCRIPTION": "Due to how this document is coded, reader software for visually impaired people cannot distinguish between separate decorative elements and real content. This issue probably originates in the application you used to make the document. Try restructuring this part of the document or editing the document in another application (e.g. LibreOffice instead of Word)."
      },
      "2": {
        "SUMMARY": "The coding of  this document does not distinguish content from decorative elements",
        "DESCRIPTION": "Due to how this document is coded, reader software for visually impaired people cannot distinguish between separate decorative elements and real content. This issue probably originates in the application you used to make the document. Try restructuring this part of the document or editing the document in another application (e.g. LibreOffice instead of Word)."
      },
      "3": {
        "SUMMARY": "The document has content that has not been tagged",
        "DESCRIPTION": "This is a critical accessibility error. If the document has content that is not tagged, reader software for people with visual impairments may have difficulty reading the document out in the right order. You can probably solve this problem by re-exporting your document from your office application (Word or LibreOffice) as tagged PDF. You do this by following the menu 'File -> Save as -> (select PDF) -> Options' and ticking the options 'Tagged PDF' and 'Save as ISO 90005-1 (PDF/A)'."
      },
      "4": {
        "SUMMARY": "The application that created the document could not guarantee a correct reading order",
        "DESCRIPTION": "You are getting this warning because the application that created the document could not guarantee a correct logical reading order. This warning alone does not imply that the reading order is compromised. The other coding issues found by this tool will point out whether there are issues with the reading order. This warning could cause reader applications to reject the document. To avoid this, try giving the document a simpler structure or editing the document in another application (e.g. LibreOffice instead of Word)."
      },
      "5": {
        "SUMMARY": "This document is not coded in a standard way",
        "DESCRIPTION": "This document uses its own structure coding that can't be mapped to standard coding. This may cause reader software for people with visual impairments to have difficulty reading the document out in the right order. This issue probably originates in the application you used to make the document. Try giving the document a simpler structure or editing the document in another application (e.g. LibreOffice instead of Word). "
      },
      "6": {
        "SUMMARY": "The document coding has circular mappings",
        "DESCRIPTION": "The document code contains a circular mapping between structure types. This may cause reader software for people with visual impairments to have difficulty reading the document out in the right order. This issue probably originates in the application you used to make the document. Try giving the document a simpler structure or editing the document in another application (e.g. LibreOffice instead of Word)."
      },
      "7": {
        "SUMMARY": "The document has altered standard tags",
        "DESCRIPTION": "The standard tags in this document have been altered. If the document does not use standard coding, then reader software for people with visual impairments may have difficulty reading the document out in the right order. This issue probably originates in the application you used to make the document. Try giving the document a simpler structure or editing the document in another application (e.g. LibreOffice instead of Word)."
      },
      "8": {
        "SUMMARY": "The document lacks essential metadata",
        "DESCRIPTION": "The document has no metadata. This causes reader software for people with visual impairments to lack essential information to process the document (such as the language it has to be read in). This issue probably originates in the application you used to make the document. Try editing the document in another application (e.g. LibreOffice instead of Word) and saving it as a tagged PDF, e.g. in PDF/A-1a or PDF/UA format."
      },
      "9": {
        "SUMMARY": "The title has not been set in the document properties",
        "DESCRIPTION": "The document metadata does not contain the title. This is probably because you did not set the title in the document properties. You can get this error even if your document does have a title page or title heading; this error is not about content but about the metadata of the document. To fix this error, open the document properties in your editor (typically via the File tab in the upper left corner of the menu) and set the title there. Or, if you have a PDF editor you can also set the title there."
      },
      "10": {
        "SUMMARY": "The title bar does not show the title",
        "DESCRIPTION": "The coding of this document does not make the reader show the title in the title bar. To solve this, first check whether the title is set in the document properties and set the title if necessary. You can do this by opening the document properties in your editor (typically via the File tab in upper left corner of the menu) and set the title there. Or, if you have a PDF editor you can also set the title there. Should you still get this error, then it probably originates in the application you used to make the document. Try editing the document in another application (e.g. LibreOffice instead of Word). If you are a PDF expert you can also use a PDF editor to set the DisplayDocTitle key to 'true' in the ViewPreferences dictionary."
      },
      "13": {
        "SUMMARY": "The tagging of this document does not match the content ",
        "DESCRIPTION": "The tag structure does not appropriately reflect the semantics of the content. This can have several causes. Try giving the document a simpler structure. The problem may also come from the application you used to make the document. Try giving the document a simpler structure or editing the document in another application (e.g. LibreOffice instead of Word). "
      }
    },
    "7.2": {
      "2": {
        "SUMMARY": "Language of the document has not been set",
        "DESCRIPTION": "Reader applications for people with visual impairments need to know in which language to read this document. You must therefore set the language of the document. If you used Word or LibreOffice to create this document, you set the language by opening the settings of the 'Standard' style and setting the desired language."
      },
      "3": {
        "SUMMARY": "There is something wrong with the table caption",
        "DESCRIPTION": "The table contains more than one caption, or the caption is not coded correctly. Try deleting all captions and then adding a caption again. Make sure the table has only one caption. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)."
      },
      "4": {
        "SUMMARY": "This text is wrongly coded as table row",
        "DESCRIPTION": "This text is marked as part of a table, but de code does not properly identify what table this text belongs to. If this text belongs to a table or is close to a table, try reformatting the table. Keep it as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)"
      },
      "5": {
        "SUMMARY": "This text is wrongly coded as table header",
        "DESCRIPTION": "This text is marked a table header, but de code does not properly identify what table this text belongs to. If this text belongs to a table, try reformatting the table. Keep the table as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)"
      },
      "6": {
        "SUMMARY": "This text is wrongly coded as table",
        "DESCRIPTION": "This text is marked as table, but de code does not properly identify what table this text belongs to. If this text belongs to a table, try reformatting the table. Keep the table as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)"
      },
      "7": {
        "SUMMARY": "This text is wrongly coded as table footer",
        "DESCRIPTION": "This text is marked as table footer, but de code does not properly identify what table this text belongs to. If this text belongs to a table, try reformatting the table. Keep the table as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)"
      },
      "8": {
        "SUMMARY": "This text is wrongly coded as table header cell",
        "DESCRIPTION": "This text is marked as table header cell but it doesn't belong to a row in the table. Try reformatting the table. Keep the table as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)"
      },
      "9": {
        "SUMMARY": "This text is wrongly coded as table content cell",
        "DESCRIPTION": "This text is marked as table content cell, but it doesn't belong to a row in the table. Try reformatting the table. Keep the table as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)"
      },
      "10": {
        "SUMMARY": "This table row contains elements that are not part of a table",
        "DESCRIPTION": "A table row may only contain table header cells or table content cells. This row contains other elements that can confuse reader software for people with visual impairments. Try reformatting the table. Keep the table as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)."
      },
      "11": {
        "SUMMARY": "Table contains more than one header",
        "DESCRIPTION": "A table may have no more than one header. If a table has more than one header, this may confuse reader software for people with visual impairments. Try reformatting the table and make sure it has only one header."
      },
      "12": {
        "SUMMARY": "Table contains more than one footer",
        "DESCRIPTION": "A table may have no more than one footer. If a table has more than one footer, this may confuse reader software for people with visual impairments. Try reformatting the table and make sure it has only one footer."
      },
      "13": {
        "SUMMARY": "The table has a footer but no body",
        "DESCRIPTION": "If a table contains a footer it must also have a body. Try reformatting the table and make sure that it has content apart from the header and footer. Keep the table as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)"
      },
      "14": {
        "SUMMARY": "The table has a header but no body",
        "DESCRIPTION": "If a table contains a header it must also have a body. Try reformatting the table and make sure that it has content apart from the header and footer. Keep the table as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)"
      },
      "15": {
        "SUMMARY": "The rows in this table don't have the same amount of cells",
        "DESCRIPTION": "Tables must have the same number of cells in each row. Try reformatting the table. You may join cells together, but always begin with a basic table that has the same number of cells in each row. Keep your table as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)."
      },
      "17": {
        "SUMMARY": "This text is wrongly marked as list element",
        "DESCRIPTION": "This text is marked as list element, but the code does not clearly indicate what list this element belongs to. If this text is part of a list or close to a list, try reformatting the list. Make sure to keep all list elements tightly together. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)."
      },
      "18": {
        "SUMMARY": "There is a problem with the structure of this list",
        "DESCRIPTION": "This text is marked as list element, but the code does not appropriately indicate what part of the list it belongs to. If this text was intended as part of the list, try reformatting the list. Make sure to keep all list elements tightly together. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)."
      },
      "19": {
        "SUMMARY": "This list contains elements that are not part of a list",
        "DESCRIPTION": "A list may only contain a caption, list items and sublists. This list contains other elements that can confuse reader software for people with visual impairments. Try reformatting the list. Keep the list as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)."
      },
      "20": {
        "SUMMARY": "A list item may contain only a label followed by the item text",
        "DESCRIPTION": "This list contains other elements that the label (e.g. a bullet or number) and the item text. Any other items can confuse reader software for people with visual impairments. Try reformatting the list. Keep the list as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)."
      },
      "21": {
        "SUMMARY": "The language of the replacement text has not been set",
        "DESCRIPTION": "Probably the language for the document has not been set. In this case reader software for people with visual impairments does not know how to read the replacement text for this text. If you used Word or LibreOffice to create this document, you set the language by opening the settings of the 'Standard' style and setting the desired language."
      },
      "22": {
        "SUMMARY": "The language of the alternative text has not been set",
        "DESCRIPTION": "Probably the language for the document has not been set. In this case reader software for people with visual impairments does not know how to read the alternative text for this element. If you used Word or LibreOffice to create this document, you set the language by opening the settings of the 'Standard' style and setting the desired language."
      },
      "23": {
        "SUMMARY": "The language of the expansion text of this abbreviation has not been set",
        "DESCRIPTION": "Probably the language for the document has not been set. In this case reader software for people with visual impairments does not know how to read the expansion text for this abbreviation. If you used Word or LibreOffice to create this document, you set the language by opening the settings of the 'Standard' style and setting the desired language."
      },
      "24": {
        "SUMMARY": "The language for this annotation has not been set",
        "DESCRIPTION": "Probably the language for the document has not been set. In this case reader software for people with visual impairments does not know how to read this annotation. If you used Word or LibreOffice to create this document, you set the language by opening the settings of the 'Standard' style and setting the desired language."
      },
      "25": {
        "SUMMARY": "The language for this form has not been set",
        "DESCRIPTION": "Probably the language for the document has not been set. In this case reader software for people with visual impairments does not know how to read this form. If you used Word or LibreOffice to create this document, you set the language by opening the settings of the 'Standard' style and setting the desired language."
      },
      "26": {
        "SUMMARY": "This text is wrongly marked as part of the table of contents",
        "DESCRIPTION": "If this text is part of the table of contents, or if it's close to the table of contents, try regenerating it. It's best to generate the table of contents automatically. If you choose to edit the table of contents manually, make sure you keep the entries together. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)."
      },
      "27": {
        "SUMMARY": "Something is wrong with the caption of the table of contents",
        "DESCRIPTION": "The table of contents has more than one caption, or the caption is not coded correctly. Try deleting all captions and then adding a caption again. Make sure the table of contents has only one caption. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)."
      },
      "29": {
        "SUMMARY": "The language of the document has not been coded correctly",
        "DESCRIPTION": "This problem is probably due to the application you used to make the document. Try setting the language of the document manually. In Word or LibreOffice you set the language by opening the settings of the 'Standard' style and setting the desired language. If this does not solve the problem, try this with another application (e.g. LibreOffice instead of Word)."
      },
      "30": {
        "SUMMARY": "The language of the replacement text has not been set",
        "DESCRIPTION": "Probably the language for the document has not been set. In this case reader software for people with visual impairments does not know how to read the replacement text for this text. If you used Word or LibreOffice to create this document, you set the language by opening the settings of the 'Standard' style and setting the desired language."
      },
      "31": {
        "SUMMARY": "The language of the alternative text has not been set",
        "DESCRIPTION": "Probably the language for the document has not been set. In this case reader software for people with visual impairments does not know how to read the alternative text for this element. If you used Word or LibreOffice to create this document, you set the language by opening the settings of the 'Standard' style and setting the desired language."
      },
      "32": {
        "SUMMARY": "The language of the expansion text of this abbreviation has not been set",
        "DESCRIPTION": "Probably the language for the document has not been set. In this case reader software for people with visual impairments does not know how to read the expansion text for this abbreviation. If you used Word or LibreOffice to create this document, you set the language by opening the settings of the 'Standard' style and setting the desired language."
      },
      "33": {
        "SUMMARY": "The language for the document metadata has not been set",
        "DESCRIPTION": "Probably the language for the document has not been set. If you used Word or LibreOffice to create this document, you set the language by opening the settings of the 'Standard' style and setting the desired language."
      },
      "34": {
        "SUMMARY": "The language for this text has not been set",
        "DESCRIPTION": "Reader software for people with visual impairments does not know in which language to read this document. Probably the language for the document has not been set. If you used Word or LibreOffice to create this document, you set the language by opening the settings of the 'Standard' style and setting the desired language."
      },
      "36": {
        "SUMMARY": "The header of this table contains elements that are not part of a header",
        "DESCRIPTION": "A table header may only contain rows. This header contains other elements that can confuse reader software for people with visual impairments. Try reformatting the table. Keep the table as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)."
      },
      "37": {
        "SUMMARY": "The body of this table contains elements that are not part of a table body",
        "DESCRIPTION": "A table body may only contain table rows. This table body contains other elements that can confuse reader software for people with visual impairments. Try reformatting the table. Keep the table as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)."
      },
      "38": {
        "SUMMARY": "The footer of this table contains elements that are not part of a table footer",
        "DESCRIPTION": "A table footer may only contain table rows. This table footer contains other elements that can confuse reader software for people with visual impairments. Try reformatting the table. Keep the table as simple as possible. Should this not solve the problem, try the same with another application (for example LibreOffice instead of Word)."
      }
    },
    "7.3": {
      "1": {
        "SUMMARY": "This figure does not have alternative text",
        "DESCRIPTION": "A figure must have an alternative text describing what the figure illustrates. In MS Word and LibreOffice you can add alternative text by right clicking on the figure and selecting 'Format figure' (Word) or 'Properties' (LibreOffice). If the figure has a decorative nature and conveys no meaning or content, it does not need alternative text and you can ignore this error message."
      }
    },
    "7.4.2": {
      "1": {
        "SUMMARY": "Incorrect use of heading levels",
        "DESCRIPTION": "Heading levels are not used in the logical order. This makes it difficult for people with visual impairments who use reader software to navigate the document. To comply with WCAG 2.1 the document must begin with a header of level 1 and heading levels must follow the logical order from higher to lower. Avoid starting the document with a heading of level 2 or 3. Do not skip heading levels: for example don't let a heading of level 3 follow a heading of level 1."
      }
    },
    "7.4.4": {
      "1": {
        "SUMMARY": "The structure of this document has not been tagged correctly",
        "DESCRIPTION": "This problem occurs in the code of the PDF file and causes people who use reader software to have trouble navigating the document. The problem is probably due to the application you used to make the document. You can try solving the problem by structuring using headings of defined heading styles Heading 1, Heading 2, etc. Should this not solve the problem, try using another application (for example LibreOffice instead of Word). "
      },
      "2": {
        "SUMMARY": "The heading structure has not been tagged correctly",
        "DESCRIPTION": "This is a problem with the tagging of headings which can cause people who use reader software to have trouble navigating the document. The problem is probably due to the application you used to make the document. You can try solving the problem by structuring using headings of defined heading styles Heading 1, Heading 2, etc. Should this not solve the problem, try using another application (for example LibreOffice instead of Word)."
      },
      "3": {
        "SUMMARY": "The heading structure has not been tagged correctly",
        "DESCRIPTION": "This is a problem with the tagging of headings which can cause people who use reader software to have trouble navigating the document. The problem is probably due to the application you used to make the document. You can try solving the problem by structuring using headings of defined heading styles Heading 1, Heading 2, etc. Should this not solve the problem, try using another application (for example LibreOffice instead of Word)."
      }
    },
    "7.5": {
      "1": {
        "SUMMARY": "The tags do not sufficiently describe the structure of this table",
        "DESCRIPTION": "This table lacks the correct tags to reflect its structure. This makes it difficult for reader software to read the table out correctly. Try reformatting the table and give the table a well defined header row or header column. Keep the table as simple as possible. Should this not solve the problem, try using another application (for example LibreOffice instead of Word)."
      }
    },
    "7.7": {
      "1": {
        "SUMMARY": "This formula does not have alternative text",
        "DESCRIPTION": "Formulas must be tagged as such and must have alternative text. In Word you can make a formula by choosing Insert - Symbol/Equation from the menu. In LibreOffice you can do this by choosing Insert -> Object -> Formula. You can also set the alternative text there. Should this not work, you can also insert the formula as image and give the image an alternative text."
      }
    },
    "7.9": {
      "1": {
        "SUMMARY": "This note is not properly tagged",
        "DESCRIPTION": "This note does not have a unique identity tag. This makes it difficult for reader software to navigate the document. It's best to avoid notes altogether for accessibility. Should you have to work with notes anyway, use the functionality your office application offers for inserting footnotes, endnotes or cross references. Should this not solve the problem, try using another application (for example LibreOffice instead of Word)."
      },
      "2": {
        "SUMMARY": "There's a problem with the indexing of notes and cross references",
        "DESCRIPTION": "The document contains conflicting references. This causes reader software to have trouble finding notes and references. It's best to avoid notes altogether for accessibility. Should you have to work with notes anyway, use the functionality your office application offers for inserting footnotes, endnotes or cross references. Should this not solve the problem, try using another application (for example LibreOffice instead of Word)."
      }
    },
    "7.10": {
      "1": {
        "SUMMARY": "A document layer has no name",
        "DESCRIPTION": "This document has one or more layers without proper identification. This problem is probably caused by the office application you used to create it. You can try solving this problem by simplifying the document. Or, if you can work with PDF tools you can solve this by flattening or merging the layers of the document."
      },
      "2": {
        "SUMMARY": "A document layer may change visibility",
        "DESCRIPTION": "This document has one or more layers that can affect the readability. This problem may have been caused by the office application you used to create it. You can try solving this problem by simplifying the document. Or, if you can work with PDF tools you can solve this by flattening or merging the layers of the document."
      }
    },
    "7.11": {
      "1": {
        "SUMMARY": "File attachment has no valid file name",
        "DESCRIPTION": "If you attach a file within a PDF document, it must be accessible via tags. The attached file does not have a tagged name and/or description. To solve this problem set the name and description of the attachment. Should you be unable to solve this, consider removing the attachment and sending it as a separate file with the document as a last resort."
      }
    },
    "7.15": {
      "1": {
        "SUMMARY": "The document contains a dynamic form",
        "DESCRIPTION": "To comply with WCAG 2.1 accessibility criteria, a document must not include dynamic XFA (XML Forum Architecture) forms. Try reformatting the form make it static. You can also try including the form in another format than XFA if your application gives you that option."
      }
    },
    "7.16": {
      "1": {
        "SUMMARY": "This file has been encrypted and no longer universally accessible",
        "DESCRIPTION": "If you encrypt a document, you must do this in a way that supports universal accessibility. Either remove the encryption from this document, or encrypt it in a way that does not disable assistive technologies. Some well known PDF applications support this."
      }
    },
    "7.18.1": {
      "1": {
        "SUMMARY": "This annotation has been tagged incorrectly",
        "DESCRIPTION": "As this annotation has not been tagged correctly, reader applications for people with visual impairments may have trouble finding or reading it. This problem is probably due to the application you used to make the document. Try removing the annotation and adding it again, or try with another application (for example LibreOffice instead of Word)."
      },
      "2": {
        "SUMMARY": "This annotation has no alternative description",
        "DESCRIPTION": "Annotations (except links, widgets, pop-ups and hidden annotations) must have textual contents or alternative text. Please add textual content or alternative text for this annotation."
      },
      "3": {
        "SUMMARY": "This form field lacks an alternative description",
        "DESCRIPTION": "A form field that is not hidden must have an alternative description. This can cause somebody using reader software to have problems filling out this form. Please add an alternative text OR make sure all widget annotations of this form field have alternative texts."
      }
    },
    "7.18.2": {
      "1": {
        "SUMMARY": "Document contains annotations used to correct colours when printed",
        "DESCRIPTION": "A document may not contain so-called 'trapping annotations' intended to correct colours for print. Please remove these annotations or disable the 'trapping' options in the application you used to make the document."
      }
    },
    "7.18.3": {
      "1": {
        "SUMMARY": "The annotations do not have a clear navigation order",
        "DESCRIPTION": "Annotations must be tagged in such a way that the navigation order is clear. This is not the case here. This is probably due to the application you used to make the document. Try removing the annotations and adding them again in the intended reading order. Should this not solve the problem, try it with a different application (for example LibreOffice instead of Word)."
      }
    },
    "7.18.4": {
      "1": {
        "SUMMARY": "This dynamic form has been tagged incorrectly",
        "DESCRIPTION": "It's better to avoid dynamic forms as they are prone to accessibility problems. If you must use a dynamic form, it must be tagged correctly so that reader software for people with visual impairments knows how to handle it. Try removing the form and adding it again, or try with another application (for example LibreOffice instead of Word)."
      }
    },
    "7.18.5": {
      "1": {
        "SUMMARY": "This reference has been tagged incorrectly",
        "DESCRIPTION": "This tagging error is common in tables of contents. If the table of contents was generated automatically, then there is not much you can do about this error except removing the table of contents or creating it manually. Fortunately, this is not a critical error for most reader applications."
      },
      "2": {
        "SUMMARY": "This link does not have an alternate description",
        "DESCRIPTION": "Hyperlinks must have a clear textual description of the destination they link to. If the hyperlink is placed under descriptive text, then you can ignore this warning. If the hyperlink has been spelled out in the document or is placed under an image, you must give an alternative description. Don't write full URLs in your document without alternative text."
      }
    },
    "7.18.6.2": {
      "1": {
        "SUMMARY": "The media type of this media clip is not correctly described by the tags",
        "DESCRIPTION": "Media clips must be tagged with a standardised description of their (MIME) type. If this is not the case, reader software for people with visual impairments does not know what to do with the media clip. This error is probably due to the application you used to make the document. Try removing the media clip and adding it explicitly as video, audio or whatever it is. Should this not work, try using another application (for example LibreOffice instead of Word)."
      },
      "2": {
        "SUMMARY": "Media clip has no alternative description",
        "DESCRIPTION": "Media clips must have an alternative description, otherwise people who cannot see or hear the clip won't know its contents. Please add an alternative description to the media clip."
      }
    },
    "7.18.8": {
      "1": {
        "SUMMARY": "Printer marks are inappropriately tagged as content",
        "DESCRIPTION": "Printer marks must be marked as 'artifacts', i.e. graphical information that does not form part of the document content. In this case the printer marks have been tagged incorrectly which makes them appear as part of the content of the document. This can confuse reader software for people with visual impairments. Try removing the printer marks and inserting them again with the corresponding options in your application (in Word:  File -> Options -> Advanced -> Crop marks). Should this not solve the problem, try with another application (for example LibreOffice instead of Word)."
      }
    },
    "7.20": {
      "1": {
        "SUMMARY": "The document includes an external document as its part",
        "DESCRIPTION": "A document must not refer to external documents as part of its content, as this makes it very difficult for reader applications to follow the logical structure of the document. Please remove such references to external content from the document."
      },
      "2": {
        "SUMMARY": "Reusable elements in this document have been tagged incorrectly",
        "DESCRIPTION": "This document contains reusable elements (so-called XObjects) that have not been tagged correctly, which may confuse reader applications. This problem is probably due to the application you used to make the document with. Check if there are any embedded figures, graphics or text that repeat throughout the document. These could cause the problem. Try inserting these elements in a different way or with a different application (for example LibreOffice instead of Word)."
      }
    },
    "7.21.3.1": {
      "1": {
        "SUMMARY": "There is a problem with the way a font is encoded. This concerns font(s): ",
        "DESCRIPTION": "This is a technical issue with the encoding of an embedded font. Try solving this problem by using another font. Use a well known standard font such as Arial or Times New Roman. Should this not solve the problem, try with another application (for example LibreOffice instead of Word)."
      }
    },
    "7.21.3.2": {
      "1": {
        "SUMMARY": "There is a problem with the way a font is encoded. This concerns font(s): ",
        "DESCRIPTION": "This is a technical issue with the encoding of an embedded scalable (OpenType or TrueType) font. Try solving this problem by using another font. Use a well known standard font such as Arial or Times New Roman. Should this not solve the problem, try with another application (for example LibreOffice instead of Word)."
      }
    },
    "7.21.3.3": {
      "1": {
        "SUMMARY": "The document does not include the encoding for a font. This concerns font(s): ",
        "DESCRIPTION": "This font has a non-standard encoding which is not included in the document. Try solving this problem by using another font. Use a well known standard font such as Arial or Times New Roman. Should this not solve the problem, try with another application (for example LibreOffice instead of Word)."
      },
      "2": {
        "SUMMARY": "A font does not have a consistent writing order. This concerns font(s): ",
        "DESCRIPTION": "The encoding of this font sets conflicting writing orders for different characters and symbols. This is a technical issue with the encoding of an embedded font. Try solving this problem by using another font. Use a well known standard font such as Arial or Times New Roman. Should this not solve the problem, try with another application (for example LibreOffice instead of Word)."
      },
      "3": {
        "SUMMARY": "A font is not encoded in a standard way. This concerns font(s): ",
        "DESCRIPTION": "This is a technical issue with the encoding of an embedded font. Try solving this problem by using another font. Use a well known standard font such as Arial or Times New Roman. Should this not solve the problem, try with another application (for example LibreOffice instead of Word)."
      }
    },
    "7.21.4.1": {
      "1": {
        "SUMMARY": "A font program is not embedded in the document. This concerns font(s): ",
        "DESCRIPTION": "All fonts that are used in the document must be embedded. This guarantees that the document can always be rendered correctly without any dependencies on specific readers. This particular font has not been embedded in the document. To solve this, try saving the document as a PDF/A-1a, PDF/A-2a or PDF/UA file. Should this not solve the problem, try using another font. Use a well known standard font such as Arial or Times New Roman. Should this not work either, try with another application (for example LibreOffice instead of Word)."
      },
      "2": {
        "SUMMARY": "A font does not contain all characters or symbols used in the document. This concerns font(s): ",
        "DESCRIPTION": "The embedded font is incomplete. To solve this, try saving the document as a PDF/A-1a, PDF/A-2a or PDF/UA file. Should this not solve the problem, try using another font. Use a well known standard font such as Arial or Times New Roman. Should this not work either, try with another application (for example LibreOffice instead of Word)."
      }
    },
    "7.21.4.2": {
      "1": {
        "SUMMARY": "Something is wrong with the encoding of a font. This concerns font(s): ",
        "DESCRIPTION": "The document code does not describe all characters and symbols belonging to this font. To solve this, try saving the document as a PDF/A-1a, PDF/A-2a or PDF/UA file. Should this not solve the problem, try using another font. Use a well known standard font such as Arial or Times New Roman. Should this not work either, try with another application (for example LibreOffice instead of Word)."
      },
      "2": {
        "SUMMARY": "Something is wrong with the encoding of a font. This concerns font(s): ",
        "DESCRIPTION": "The document code does not describe all characters and symbols belonging to this font. To solve this, try saving the document as a PDF/A-1a, PDF/A-2a or PDF/UA file. Should this not solve the problem, try using another font. Use a well known standard font such as Arial or Times New Roman. Should this not work either, try with another application (for example LibreOffice instead of Word)."
      }
    },
    "7.21.5": {
      "1": {
        "SUMMARY": "A font does not have consistent character widths. This concerns font(s): ",
        "DESCRIPTION": "The encoding of this font sets conflicting character and symbol widths. This can make it difficult for readers to display text correctly. This is a technical issue with the encoding of an embedded font. Try solving this problem by using another font. Use a well known standard font such as Arial or Times New Roman. Should this not solve the problem, try with another application (for example LibreOffice instead of Word)."
      }
    },
    "7.21.6": {
      "1": {
        "SUMMARY": "There is something wrong with the encoding of a font. This concerns font(s): ",
        "DESCRIPTION": "The encoding of this font does not allow the display of all characters and symbols to be looked up. This is a technical issue with the encoding of an embedded font. Try solving this problem by using another font. Use a well known standard font such as Arial or Times New Roman. Should this not solve the problem, try with another application (for example LibreOffice instead of Word)."
      },
      "2": {
        "SUMMARY": "There is something wrong with the encoding of a font. This concerns font(s): ",
        "DESCRIPTION": "Fonts must be encoded in a standard way. If not, then reader applications may have problems displaying the correct characters. In this case the encoding does not comply with the required standard for accessibility. This is a technical issue with the encoding of an embedded font. Try solving this problem by using another font. Use a well known standard font such as Arial or Times New Roman. Should this not solve the problem, try with another application (for example LibreOffice instead of Word)."
      },
      "3": {
        "SUMMARY": "There is something wrong with the encoding of a symbol font. This concerns font(s): ",
        "DESCRIPTION": "The encoding of this symbol font does not comply with the required standard for accessibility, causing reader applications to have problems displaying the correct symbols. This is a technical issue with the encoding of an embedded font. Try solving this problem by using another font. Use a well known standard symbolic font such as Wingdings. Should this not solve the problem, try with another application or avoid the symbols altogether."
      },
      "4": {
        "SUMMARY": "There is something wrong with the encoding of a symbol font. This concerns font(s): ",
        "DESCRIPTION": "These symbols have an ambiguous encoding, which causes reader applications to have problems looking up which symbol to display. This is a technical issue with the encoding of an embedded font. Try solving this problem by using another font. Use a well known standard symbolic font such as Wingdings. Should this not solve the problem, try with another application or avoid the symbols altogether."
      }
    },
    "7.21.7": {
      "1": {
        "SUMMARY": "A character has no standard code. This concerns font(s): ",
        "DESCRIPTION": "To accommodate reader applications for people with visual impairments, all fonts in this document must have a standard Unicode encoding. This is not the case here. First make sure to export your document as a PDF with Unicode, for example by exporting to PDF/UA, PDF/A-1a or PDF/A-2a. If this doesn't solve the problem, try using another font. Use a well known standard font such as Arial or Times New Roman. Should this not solve the problem either, try with another application (for example LibreOffice instead of Word)."
      },
      "2": {
        "SUMMARY": "A character has an invalid code. This concerns font(s): ",
        "DESCRIPTION": "To accommodate reader applications for people with visual impairments, all fonts in this document must have a standard Unicode encoding. The Unicode value for this character is invalid. This problem is probably due to the font or the application used to export the document. Try using another font. Use a well known standard font such as Arial or Times New Roman. Export the document as PDF/UA, PDF/A-1a or PDF/A-2a. Should this not solve the problem either, try with another application (for example LibreOffice instead of Word)."
      }
    },
    "7.21.8": {
      "1": {
        "SUMMARY": "The document contains undefined characters. This concerns font(s): ",
        "DESCRIPTION": "A document must not contain undefined characters or symbols. Reader applications for people with visual impairments don't know how to handle these. If you know which characters or symbols cause this problem, remove them from the document. Or try using another font. Use a well known standard font such as Arial or Times New Roman. Should this not solve the problem either, try with another application (for example LibreOffice instead of Word)."
      }
    }
  }
}
